Network Working Group               G. Sidebottom, L. Ong, Guy Mousseau
INTERNET-DRAFT                                          Nortel Networks
                                                             Ian Rytina
                                                               Ericsson
                          Hanns-Juergen Schwarzbauer, Klaus Gradischnig
                                                                Siemens
                                                          Ken Morneault
                                                                  Cisco
                                                          Mallesh Kalla
                                                              Telcordia
                                                         Normand Glaude
                                               Performance Technologies

Expires in six months                                         Nov 2000



                SS7 MTP3-User Adaptation Layer (M3UA)
                  <draft-ietf-sigtran-m3ua-05.txt>


Status of This Memo

This document is an Internet-Draft and is in full conformance with all 
provisions of Section 10 of RFC 2026. Internet-Drafts are working 
documents of the Internet Engineering Task Force (IETF), its areas, and 
its working groups.  Note that other groups may also distribute working 
documents as Internet-Drafts.

Internet-Drafts are draft documents valid for a maximum of six months 
and may be updated, replaced, or obsoleted by other documents at any 
time.  It is inappropriate to use Internet-Drafts as reference material 
or to cite them other than as 'work in progress.'


     The list of current Internet-Drafts can be accessed at
     http://www.ietf.org/ietf/1id-abstracts.txt

     The list of Internet-Draft Shadow Directories can be accessed at
     http://www.ietf.org/shadow.html.


To learn the current status of any Internet-Draft, please check the 
'1id-abstracts.txt' listing contained in the Internet- Drafts Shadow 
Directories on ftp.is.co.za (Africa), nic.nordu.net (Europe), 
munnari.oz.au (Pacific Rim), ftp.ietf.org (US East Coast), or 
ftp.isi.edu (US West Coast).



Abstract

This Internet Draft defines a protocol for supporting the transport of 
any SS7 MTP3-User signalling (e.g., ISUP and SCCP messages) over IP 
using the services of the Stream Control Transmission Protocol.  Also, 
provision is made for protocol elements that enable a seamless 
operation of the MTP3-User peers in the SS7 and IP domains. This 
protocol would be used between a Signalling Gateway (SG) and a Media 
Gateway Controller (MGC) or IP-resident Database.  It is assumed that 
the SG receives SS7 signalling over a standard SS7 interface using the 
SS7 Message Transfer Part (MTP) to provide transport. 



Sidebottom et al                                              [Page 1]

Internet Draft         SS7 MTP3-User Adaptation Layer         Nov 2000


                        TABLE OF CONTENTS

1. Introduction.......................................................3
    1.1 Scope.........................................................3
    1.2 Terminology...................................................3
    1.3 M3UA Overview.................................................5
    1.4 Functional Areas.............................................10
    1.5 Sample Configurations........................................18
    1.6 Definition of M3UA Boundaries................................21
2. Conventions.......................................................22
3. M3UA Protocol Elements............................................22
    3.1 Common Message Header........................................22
    3.2 Variable-Length Parameter Format 
    3.3 Transfer Messages............................................24 
    3.4 SS7 Signalling Network management (SSNM) Messages............26
    3.5 Application Server Process Maintenance Messages..............32
    3.6 Management Messages..........................................40
4. Procedures........................................................44
    4.1 Procedures to Support the Services of the M3UA Layer.........44
    4.2 Procedures to Support the M3UA Services in Section 1.4.2.....44
    4.3 Procedures to Support the M3UA Services in Section 1.4.4.....45
    4.4 Procedures to Support the M3UA Services in Section 1.4.3.....52 
5. Examples of M3UA Procedures.......................................54
    5.1 Establishment of Association and Traffic 
        Between SGs and ASPs.........................................54
    5.2 ASP traffic Fail-over Examples...............................56
    5.3 M3UA/MTP3-User Boundary Examples.............................57
6. Security..........................................................61
    6.1 Introduction.................................................61
    6.2 Threats......................................................61
    6.3 Protecting Confidentiality...................................62
7. IANA Considerations...............................................62
    7.1 SCTP Payload Protocol Identifier.............................62
    7.2 M3UA Protocol Extensions.....................................62
8. Acknowledgements..................................................62
9. References........................................................62
10. Author's Addresses...............................................65















Sidebottom et al                                              [Page 2]

Internet Draft         SS7 MTP3-User Adaptation Layer         Nov 2000


1.  Introduction

1.1 Scope

There is a need for SCN signalling protocol delivery from an SS7 
Signalling Gateway (SG) to a Media Gateway Controller (MGC) or IP-
resident Database as described in the Framework Architecture for 
Signalling Transport [1].  The delivery mechanism should meet the 
following criteria: 

*  Support for the transfer of all SS7 MTP3-User Part messages (e.g., 
   ISUP, SCCP, TUP, etc.)
*  Support for the seamless operation of MTP3-User protocol peers
*  Support for the management of SCTP transport associations and 
   traffic between an SG and one or more MGCs or IP-resident Databases 
*  Support for MGC or IP-resident Database process fail-over and load-
   sharing
*  Support for the asynchronous reporting of status changes to 
   management 

In simplistic transport terms, the SG will terminate SS7 MTP2 and MTP3 
protocol layers and deliver ISUP, SCCP and/or any other MTP3-User 
protocol messages over SCTP transport associations to MTP3-User peers 
in MGCs or IP-resident Databases.


1.2 Terminology

Application Server (AS) - A logical entity serving a specific Routing 
Key. An example of an Application Server is a virtual switch element 
handling all call processing for a unique range of PSTN trunks, 
identified by an SS7 DPC/OPC/CIC_range.  Another example is a virtual 
database element, handling all HLR transactions for a particular SS7 
DPC/OPC/SCCP_SSN combination.  The AS contains a set of one or more 
unique Application Server Processes, of which one or more is normally 
actively processing traffic.

Application Server Process (ASP) - A process instance of an Application 
Server. An Application Server Process serves as an active or standby 
process of an Application Server (e.g., part of a distributed virtual 
switch or database). Examples of ASPs are processes (or process 
instances) of MGCs, IP SCPs or IP HLRs.  An ASP contains an SCTP end-
point and may be configured to process signalling traffic within more 
than one Application Server. 

Association - An association refers to an SCTP association.  The 
association provides the transport for MTP3-User protocol data units 
and M3UA adaptation layer peer messages.

IP Server Process (IPSP) - A process instance of an IP-based 
application.  An IPSP is essentially the same as an ASP, except that it 

Sidebottom et al                                              [Page 3]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


uses MU3A in a peer-to-peer fashion.  Conceptually, an IPSP does not 
use the services of a signalling gateway.

Signalling Gateway Process (SGP) - A process instance of a Signalling 
Gateway.  It serves as an active, standby or load-sharing process of a 
Signalling Gateway.

Signalling Process - A process instance that uses M3UA to communicate 
with other signalling process.  An ASP, a signalling gateway process 
and an IPSP are all signalling processes.

Routing Key: A Routing Key describes a set of SS7 parameter and 
parameter values that uniquely define the range of signalling traffic 
to be handled by a particular Application Server. For example, where 
all traffic directed to an SS7 DPC, OPC and ISUP CIC_range(s) or SCCP 
SSN is to be sent to a particular Application Server, that SS7 data 
defines the associated Routing Key.  Routing Keys are unique in the 
sense that a received SS7 signalling message cannot be directed to more 
than one Routing Key.   Also, a Routing Key cannot extend across more 
than a single SS7 DPC, in order to more easily support SS7 Management 
procedures.  It is not necessary for the parameter range values within 
a particular Routing Key to be contiguous.  For example, an ASP could 
be configured to support call processing for multiple ranges of PSTN 
trunks that are not represented by contiguous CIC values.

Routing Context - An Application Server Process may be configured to 
process signalling traffic related to more than one Application Server, 
over a single SCTP Association.  At an ASP, the Routing Context 
parameter uniquely identifies the range of signalling traffic 
associated with each Application Server that the ASP is configured to 
receive.  There is a 1:1 relationship between a received Routing 
Context value and a Routing Key entry at the sending node.  Therefore 
the Routing Context can be viewed as an index into a sending node's 
Message Distribution Table containing the Routing Key entries. 

Fail-over - The capability to re-route signalling traffic as required 
to an alternate Application Server Process, or group of ASPs, within an 
Application Server in the event of failure or unavailability of a 
currently used Application Server Process.  Fail-back may apply upon 
the return to service of a previously unavailable Application Server 
Process.

Signalling Point Management Cluster (SPMC) - The complete set of 
Application Servers represented to the SS7 network under one specific 
SS7 Point Code of one specific Network Appearance.  SPMCs are used to 
sum the availability / congestion / User_Part status of an SS7 
destination point code that is distributed in the IP domain, for the 
purpose of supporting MTP3 management procedures at an SG.  In some 
cases, the SG itself may also be a member of the SPMC.  In this case, 
the SG availability / congestion / User_Part status must also be taken 
into account when considering any supporting MTP3 management actions.  

Sidebottom et al                                              [Page 4]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


MTP - The Message Transfer Part of the SS7 protocol.

MTP3 - MTP Level 3, the signalling network layer of SS7
MTP3-User - Any protocol normally using the services of the SS7 MTP3 
(e.g., ISUP, SCCP, TUP, etc.).

Network Appearance - The Network Appearance identifies an SS7 network 
context for the purposes of logically separating the signalling traffic 
between the SG and the Application Server Processes over a common SCTP 
Association.  An example is where an SG is logically partitioned to 
appear as an element in four separate national SS7 networks.  A Network 
Appearance implicitly defines the SS7 Point Code(s), Network Indicator 
and MTP3 protocol type/variant/version used within a specific SS7 
network partition.  A physical SS7 route-set or link-set at an SG can 
appear in only one network appearance. The Network Appearance is not 
globally significant and requires coordination only between the SG and 
the ASP. Therefore, in the case where an ASP is connected to more than 
one SG, the same SS7 network context may be identified by different 
Network Appearances depending over which SG a message is being 
transmitted/received.

Network Byte Order: Most significant byte first, a.k.a Big Endian.

Layer Management - Layer Management is a nodal function that handles 
the inputs and outputs between the M3UA layer and a local management 
entity.  

Host - The computing platform that the ASP process is running on.

Stream - A stream refers to an SCTP stream; a uni-directional logical
channel established from one SCTP endpoint to another associated SCTP
endpoint, within which all user messages are delivered in-sequence
except for those submitted to the un-ordered delivery service.


1.3 M3UA Overview

1.3.1 Protocol Architecture.  

The framework architecture that has been defined for SCN signalling 
transport over IP [1] uses multiple components, including a common 
signalling transport protocol and an adaptation module to support the 
services expected by a particular SCN signalling protocol from its 
underlying protocol layer.  

Within the framework architecture, this document defines an MTP3-User 
adaptation module suitable for supporting the transfer of messages of 
any protocol layer that is identified to the MTP Level 3 layer, in SS7 
terms, as a user part.  The list of these protocol layers include, but 
is not limited to, ISDN User Part (ISUP) [2,3,4], Signalling Connection 
Control Part (SCCP) [5,6,7] and Telephone User Part (TUP) [8].  TCAP 

Sidebottom et al                                              [Page 5]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


[9,10,11] or RANAP [12] messages are transferred transparently by the 
M3UA as SCCP payload, as they are SCCP-User protocols.  

It is recommended that the M3UA use the services of the Stream Control 
Transmission Protocol (SCTP) [13] as the underlying reliable common 
signalling transport protocol. This is to take advantage of various 
SCTP features such as:

   - Explicit packet-oriented delivery (not stream-oriented);
   - Sequenced delivery of user messages within multiple streams,
     with an option for order-of-arrival delivery of individual
     user messages, 
   - Optional multiplexing of user messages into SCTP datagrams; 
   - Network-level fault tolerance through support of multi-homing
     at either or both ends of an association;
   - Resistance to flooding and masquerade attacks; and   
   - Data segmentation to conform to discovered path MTU size. 

Under certain scenarios, such as back-to-back connections without 
redundancy requirements, the SCTP functions above may not be necessary.  
In these cases, it is acceptable to use TCP as the underlying common 
transport protocol.  

1.3.2 Services Provided by the M3UA Layer

The M3UA Layer at an ASP provides the equivalent set of primitives at 
its upper layer to the MTP3-Users as provided by the MTP Level 3 to its 
local users at an SS7 SEP.  In this way, the ISUP and/or SCCP layer at 
an ASP is unaware that the expected MTP3 services are offered remotely 
from an MTP3 Layer at an SG, and not by a local MTP3 layer.  The MTP3 
layer at an SG may also be unaware that its local users are actually 
remote user parts over M3UA.  In effect, the M3UA extends access to the 
MTP3 layer services to a remote IP-based application.  The M3UA does 
not itself provide the MTP3 services.  In the case where an ASP is 
connected to more than one SG, however, the M3UA must maintain the 
status of configured SS7 destinations and route messages according to 
availability/congestion status of the routes to these destinations.

The M3UA Layer may also be used for point-to-point signalling between 
two IP Server Processes (IPSPs).  In this case, the M3UA provides the 
same set of primitives and services at its upper layer as the MTP3.  
However, in this case the expected MTP3 services are not offered 
remotely from an SG.  The MTP3 services are provided but the procedures 
to support these services are a subset of the MTP3 procedures due to 
the simplified point-to-point nature of the IPSP to IPSP relationship.

1.3.2.1 Support for the transport of MTP3-User Messages

The M3UA provides the transport of MTP-TRANSFER primitives across an 
established SCTP association between an SG and an ASP or between 
IPSPs.

Sidebottom et al                                             [Page 6]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


The MTP-TRANSFER primitive information is encoded as in MTP3-User 
messages.  In this way, the SCCP and ISUP messages received from the 
SS7 network by the SG are not re-encoded into a different format for 
transport between the M3UA peers.  The MTP3 Service Information Octet 
(SIO) and Routing Label (OPC, DPC, and SLS) are included, encoded as 
expected by the MTP3-User protocol layer. 

At an ASP, in the case where a destination is reachable via multiple 
SGs, the M3UA must also choose via which SG the message is to be routed 
or support load balancing across the SGs, ensuring that no mis-
sequencing occurs.

The M3UA does not impose a 272-octet user information block limit as 
specified by the SS7 MTP Level 3 protocol.  Larger information blocks 
can be accommodated directly by M3UA/SCTP, without the need for an 
upper layer segmentation/re-assembly procedure as specified in recent 
SCCP or ISUP versions.  However, in the context of an SG, the maximum 
272-octet block size must be followed when inter-working to a SS7 
network that does not support the transfer of larger information blocks 
to the final destination.  This avoids potential ISUP or SCCP 
fragmentation requirements at the SG.  However, if the SS7 network is 
provisioned to support the Broadband MTP [20] to the final SS7 
destination, the information block size limit may be increased past 272 
octets.  

1.3.2.2 Native Management Functions

The M3UA provides management of the underlying SCTP transport protocol 
to ensure that SG-ASP and IPSP-IPSP transport is available to the 
degree called for by the MTP3-User signalling applications.

The M3UA provides the capability to indicate errors associated with 
received M3UA messages and to notify, as appropriate, local management 
and/or the peer M3UA.

1.3.2.3 Inter-working with MTP3 Network Management Functions

At the SG, the M3UA must also provide inter-working with MTP3 
management functions to support seamless operation of the user SCN 
signalling applications in the SS7 and IP domains.  This includes:
 
  - Providing an indication to MTP3-Users at an ASP that a remote 
destination in the SS7 network is not reachable.

  - Providing an indication to MTP3-Users at an ASP that a remote 
destination in the SS7 network is now reachable.

  - Providing an indication to MTP3-Users at an ASP that messages to a 
remote MTP3-User peer in the SS7 network are experiencing SS7 
congestion.


Sidebottom et al                                             [Page 7]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


  - Providing an indication to MTP3-Users at an ASP that a remote MTP3-
User peer is unavailable.  

The M3UA layer at an ASP may initiate an audit of the availability or 
the congested state of remote SS7 destinations.  This information is 
requested from the M3UA at the SG. 

The M3UA layer at an ASP may also indicate to the SG that the M3UA 
itself or the ASP or the ASP's host is congested.

1.3.2.4 Support for the management of SCTP associations between the SG 
and ASPs.

The M3UA layer at the SG maintains the availability state of all 
configured local and remote ASPs, in order to manage the SCTP 
Associations and the traffic between the M3UA peers.  As well, the 
active/inactive state of local and remote ASPs is also maintained.

The M3UA layer may be instructed by local management to establish an 
SCTP association to a peer M3UA node.  This can be achieved using the 
M-SCTP ESTABLISH primitive to request, indicate and confirm the 
establishment of an SCTP association with a peer M3UA node.  In order 
to avoid redundant SCTP associations between two M3UA peers, one side 
must be designated to establish the SCTP association or the mutual SCTP 
endpoint addresses must be pre-configured.

The M3UA layer may also need to inform local management of the status 
of the underlying SCTP associations using the M-SCTP STATUS request and 
indication primitive. For example, the M3UA may inform local management 
of the reason for the release of an SCTP association, determined either 
locally within the M3UA layer or by a primitive from the SCTP.

Also the M3UA layer may need to inform the local management of the 
change in status of an ASP or AS.  This may be achieved using the M-ASP 
STATUS request or M-AS STATUS request primitives.

1.3.2.5 Support for the management of connections to multiple SGs

As shown in Figure 1 an ASP may be connected to multiple SGs. In such a 
case a particular SS7 destination may be reachable via more than SG, 
i.e., via more than one route. As MTP3 users only maintain status on a 
destination and not on a route basis M3UA must maintain the status 
(availability and/or congestion of route to destination) of the 
individual routes, derive the overall status of the destination from 
the status of the individual routes, and inform the MTP3 users of this 
derived status whenever it changes.

1.3.3 Signalling Network Architecture

A Signalling Gateway is used to support the transport of MTP3-User 
signalling traffic received from the SS7 network to multiple

Sidebottom et al                                              [Page 8]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


distributed ASPs (e.g., MGCs and IP Databases).  Clearly, the M3UA 
protocol is not designed to meet the performance and reliability 
requirements for such transport by itself.  However, the conjunction of 
distributed architecture and redundant networks does allow for a 
sufficiently reliable transport of signalling traffic over IP.  The 
M3UA protocol is flexible enough to allow its operation and management 
in a variety of physical configurations, enabling Network Operators to 
meet their performance and reliability requirements.  

To meet the stringent SS7 signalling reliability and performance 
requirements for carrier grade networks, Network Operators should 
ensure that no single point of failure is present in the end-to-end 
network architecture between an SS7 node and an IP-based application.  
This can typically be achieved through the use of redundant SGs, 
redundant hosts, and the provision of redundant QOS-bounded IP network 
paths for SCTP Associations between SCTP End Points. Obviously, the 
reliability of the SG, the MGC and other IP-based functional elements 
also needs to be taken into account.  The distribution of ASPs within 
the available Hosts must also be considered.  As an example, for a 
particular Application Server, the related ASPs should be distributed 
over at least two Hosts.

One example of a physical network architecture relevant to SS7 carrier-
grade operation in the IP network domain is shown in Figure 1 below:




























Sidebottom et al                                              [Page 9]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000

          SG                                     MGC

  Host#1 **************                          ************** Host#1
     =   *  ********__*__________________________*__********  *   =
    SG1  *  * SGP1 *__*_____      _______________*__* ASP1 *  *  MGC1
         *  ********  *     \    /               *  ********  *
         *  ********__*______\__/________________*__********  *
         *  * SGP2 *__*_______\/______      _____*__* ASP2 *  *
         *  ********  *       /\      |    |     *  ********  *
         *      :     *      /  \     |    |     *      :     *
         *  ********  *     /    \    |    |     *  ********  *
         *  * SGPn *  *     |    |    |    |     *  * ASPn *  *
         *  ********  *     |    |    |    |     *  ********  *
         **************     |    |    |    |     **************
                            |    |    \    /
  Host#2 **************     |    |     \  /      ************** Host#2
     =   *  ********__*_____|    |______\/_______*__********  *   =
    SG2  *  * SGP1 *__*_________________/\_______*__* ASP1 *  *  MGC2
         *  ********  *                /  \      *  ********  *
         *  ********__*_______________/    \_____*__********  *
         *  * SGP2 *__*__________________________*__* ASP2 *  *
         *  ********  *                          *  ********  *
         *      :     *     SCTP Associations    *      :     *
         *  ********  *                          *  ********  *
         *  * SGPn *  *                          *  * ASPn *  *
         *  ********  *                          *  ********  *
         **************                          **************

                      Figure 1 - Physical Model


In this model, each host has many application processes.  In the case 
of the MGC, an ASP may provide service to one or more application 
server, and is identified as an SCTP end point.  In the case of the SG, 
a pair of signalling gateway processes may represent, as an example, a 
single network appearance, serving a signalling point management 
cluster.

This example model can also be applied to IPSP-IPSP signalling.  In 
this case, each IPSP would have its services distributed across 2 hosts 
or more, and may have multiple server processes on each host.

In the example above, each signalling process (SGP, ASP or IPSP) is the 
end point to more than one SCTP association, leading to many other 
signalling processes.  To support this, a signalling process must be 
able to support distribution of M3UA messages to many simultaneous 
active associations.  This message distribution function is based on 
the status of provisioned routing keys, the availability of signalling 
points in the SS7 network, and the redundancy model (active-standby, 
load-sharing, n+k) of the remote signalling processes.



Sidebottom et al                                             [Page 10]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000

For carrier grade networks, Operators should ensure that under failure 
or isolation of a particular signalling process, stable calls or 
transactions are not lost.  This implies that signalling processes 
need, in some cases, to share the call or transaction state information 
with other signalling processes.  In the case of ASPs performing call 
processing, coordination may also be required with the related Media 
Gateway to transfer the MGC control for a particular trunk termination.  
However, this sharing or communication is outside the scope of this 
document.

This model serves as an example.  M3UA imposes no restrictions as to 
the exact layout of the network elements, the message distribution 
algorithms and the distribution of the signalling processes.  Instead, 
it provides a framework and a set of messages that allow for a flexible 
and scalable signalling network architecture, aiming to provide 
reliability and performance.


1.4 Functional Areas

1.4.1 Signalling Point Code Representation

Within an SS7 network, a Signalling Gateway is charged with 
representing a set of nodes in the IP domain into the SS7 network for 
routing purposes.  The SG itself, as a physical node in the SS7 
network, must be addressable with an SS7 Point Code for MTP3 Management 
purposes. The SG Point Code may also be used for addressing any local 
MTP3-Users at the SG such as an SG-resident SCCP function.  

An SG may be logically partitioned to operate in multiple SS7 network
Appearances.  In such a case, the SG must be addressable with a Point 
Code in each network appearance, and represents a set of nodes in the 
IP domain into each SS7 network.  Alias PCs may also be used within an 
SG network appearance. 

The M3UA places no restrictions on the SS7 Point Code representation of 
an AS.  Application Servers can be represented under the same PC of the 
SG, their own individual Point Codes or grouped with other applications 
for Point Code preservation purposes.  A single Point Code may be used 
to represent the SG and all the ASPs together, if desired. 

Where Application Servers are grouped under a Point Code address, an 
SPMC will include more than one AS. If full advantage of SS7 management 
procedures is to be taken (as is advisable in carrier grade networks) 
care must be taken that, if (the connection to) one AS of an SPMC 
fails, all AS of the SPMC fail or become unreachable from the SG. If 
this is not the case, usage of SS7 transfer prohibited procedures by 
the SG becomes problematic as either traffic to the failed AS cannot be 
stopped/diverted or traffic to a still available AS will unnecessarily 
be stopped/diverted. (Depending on the network configuration it may 
even be necessary to assign an individual SS7 point code to each AS.)  


Sidebottom et al                                             [Page 11]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000

Observing these principles is of particular importance if alternative 
routing possibilities exist on the SS7 level (e.g. via mated SGs) or 
application level (e.g. via another MGC/MG).

If an ASP or group of ASPs is available to the SS7 network via more 
than one SG, each with its own Point Code, the ASP(s) should be 
represented by a Point Code that is separate from any SG Point Code.  
This allows these SGs to be viewed from the SS7 network as "STPs", each 
having an ongoing  "route" to the same ASP(s).  Under failure 
conditions where the  ASP(s) become(s) unavailable from one of the SGs, 
this approach enables MTP3 route management messaging between the SG 
and SS7 network, allowing simple SS7 re-routing through an alternate SG 
without changing the Destination Point Code Address of SS7 traffic to 
the ASP(s). 

Where an AS can be reached via more than one SG it is equally important 
that the corresponding Routing Keys in the involved SGs are identical.  
(Note: It is possible for the Routing Key configuration data to be 
temporarily out-of-synch during configuration updates).


                           +--------+ 
                           |        | 
              +------------+  SG 1  +--------------+ 
  +-------+   |  SS7 links | "STP"  |  IP network  |     ---- 
  |  SEP  +---+            +--------+              +---/      \ 
  |   or  |                                           |  ASPs  | 
  |  STP  +---+            +--------+              +---\      / 
  +-------+   |            |        |              |     ---- 
              +------------+  SG 2  +--------------+ 
                           | "STP"  | 
                           +--------+

Note: there is no SG-to-SG communication shown, so each SG can be 
reached only via the direct linkset from the SS7 network. 

The following example shows a signalling gateway partitioned into two 
network appearances.

                               SG
  +-------+              +---------------+
  |  SEP  +--------------| SS7 Ntwk |M3UA|              ----
  +-------+   SS7 links  |   "A"    |    |            /      \
                         |__________|    +-----------+  ASPs  |
                         |          |    |            \      /
  +-------+              | SS7 Ntwk |    |              ----
  |  SEP  +--------------+   "B"    |    |
  +-------+              +---------------+





Sidebottom et al                                             [Page 12]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


1.4.2 Message Distribution

1.4.2.1 Address Translation and Mapping at the SG

In order to direct messages received from the SS7 MTP3 network to the 
appropriate IP destination, the SG must perform address translation and 
mapping functions using information from the received MTP3-User 
message.

To support this message distribution, the SG must maintain the 
equivalent of a network address translation table, mapping incoming SS7 
message information to an Application Server for a particular 
application and range of traffic.  This is accomplished by comparing 
elements of the incoming SS7 message to provisioned Routing Keys in the 
SG.  These Routing Keys in turn make reference to an Application Server 
that is enabled by one or more ASP.  These ASPs provide dynamic status 
information to the SG using various management messages defined in the 
M3UA protocol.  Possible SS7 address/routing information that comprise 
a Routing Key entry includes, for example, the OPC, DPC, SIO found in 
the MTP3 routing label, or other MTP3-User specific fields such as the 
ISUP CIC, SCCP subsystem number, or TCAP transaction ID. Some example 
routing keys are: the DPC alone, the DPC/OPC combination, the 
DPC/OPC/CIC combination, or the DPC/SSN combination.  The particular 
information used to define an M3UA Routing Key is application and 
network dependent, and none of the above examples are mandated.

An Application Server contains a list of one or more ASPs that are 
capable of processing the traffic.  This list is assumed to be dynamic, 
taking into account the availability status of the individual ASPs in 
the list, configuration changes, and possible fail-over mechanisms. The 
M3UA protocol includes messages to convey the availability status of 
the individual ASPs as input to a fail-over mechanism.

Normally, one or more ASPs is active in the ASP (i.e., currently 
processing traffic) but in certain failure and transition cases it is 
possible that there may not be an active ASP available.  Both load-
sharing and backup scenarios are supported.

When there is no Routing Key match for an incoming SS7 message, a 
default treatment must be specified.  Possible solutions are to provide 
a default Application Server at the SG that directs all unallocated 
traffic to a (set of) default ASP(s), or to drop the messages and 
provide a notification to management.  The treatment of unallocated 
traffic is implementation dependent.

1.4.2.2 Address Translation and Mapping at the ASP

In order to direct messages to the SS7 network, the ASP must also 
perform an address translation and mapping function in order to choose 
the proper SG or SGP for a given message.  This is accomplished by 
observing the Destination Point Code and other elements of the outgoing

Sidebottom et al                                             [Page 13]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


message, SS7 network status, SG and SGP availability, and network 
appearance configuration tables.

A remote Signalling Gateway may be composed of one or more SGPs that 
are capable of routing SS7 traffic.  As is the case with ASPs, a 
dynamic list of SGPs in an SG can be maintained, taking into account 
the availability status of the individual SGPs, configuration changes 
and fail-over mechanisms. There is, however, no M3UA messaging to 
manage the status of an SGP. Whenever an SCTP association to an SGP 
exists, it is assumed to be available.  Also, every SGP of one SG 
communicating with one ASP regarding one AS provides identical SS7 
connectivity to this ASP.

1.4.3 SS7 and M3UA Interworking

In the case of SS7 and M3UA inter-working, the M3UA adaptation layer is 
designed to provide an extension of the MTP3 defined user primitives.


1.4.3.1 Signalling Gateway SS7 Layers

The SG is responsible for terminating MTP Level 3 of the SS7 protocol, 
and offering an IP-based extension to its users.

>From an SS7 perspective, it is expected that the Signalling Gateway 
(SG) transmits and receives SS7 Message Signalling Units (MSUs) to and 
from 
the PSTN over a standard SS7 network interface, using the SS7 Message 
Transfer Part (MTP) [14,15,16] to provide reliable transport of the 
messages.

As a standard SS7 network interface, the use of MTP Level 2 signalling 
links is not the only possibility.  ATM-based High Speed Links can also 
be used with the services of the Signalling ATM Adaptation Layer (SAAL) 
[17,18].  It is possible for IP-based links to be present, using the 
services of the MTP2-User Adaptation Layer (M2UA) [19].  These SS7 
datalinks may be terminated at a Signalling Transfer Point (STP) or at 
a Signalling End Point (SEP).  Using the services of MTP3, the SG may 
be capable of communicating with remote SS7 SEPs in a quasi-associated 
fashion, where STPs may be present in the SS7 path between the SEP and 
the SG.

Where ATM-based High Speed Links are used in the SS7 network, it is 
possible for the SG to use the services of the MTP-3b [20] for reliable 
transport to and from an SS7 SEP or STP. The maximum Service Data Unit 
(SDU) supported by the MTP-3b is 4096 octets compared to the 272-octet 
maximum of the MTP3.  However, for MTP3-Users to take advantage of the 
larger SDU between MTP3-User peers, network architects should ensure 
that MTP3-b is used end-to-end between the SG and the SS7-resident 
peer.  


Sidebottom et al                                             [Page 14]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


1.4.3.2 SS7 and M3UA Inter-Working at the SG

The SG provides a functional inter-working of transport functions 
between the SS7 network and the IP network by also supporting the M3UA 
adaptation layer.  It allows the transfer of MTP3-User signalling 
messages to and from an IP-based Application Server Process where the 
peer MTP3-User protocol layer exists.

The Signalling Gateway must maintain knowledge of SS7 node and 
Signalling Point Management Cluster (SPMC) status in their respective 
domains in order to perform a seamless inter-working of the IP-based 
signalling and the SS7 domains.  For example, SG knowledge of the 
availability and/or congestion status of the SPMC and SS7 nodes must be 
maintained and disseminated in the respective networks, in order to 
ensure that end-to-end operation is transparent to the communicating 
SCN protocol peers at the SS7 node and ASP.

When the SG determines that the transport of SS7 messages to an SPMC 
(or possibly to parts of an SPMC) is encountering congestion, the SG 
should inform the MTP3 route management function (by an implementation-
dependent mechanism).  This information is used by the MTP3 to mark the 
"route" to the affected destination as congested and to trigger MTP 
Transfer Controlled (TFC) messages to any SS7 SEPs generating traffic 
to the congested DPC, as per current MTP3 procedures.

When the SG determines that the transport of SS7 messages to all ASPs 
in a particular SPMC is interrupted, then it should similarly inform 
the MTP3 route management function.  This information is used by the 
MTP3 to mark the "route" to the affected destination as unavailable, 
and in the case of the SG acting as a signalling transfer point (i.e., 
the Point Code of the SG is different from that of the SPMC), to send 
MTP Transfer Prohibited (TFP) messages to the relevant adjacent SS7 
nodes, according to the local SS7 network procedures. 

When the SG determines that the transport of SS7 messages to an ASP in 
a particular SPMC can be resumed, the SG should similarly inform the 
MTP3 route management function.  This information is used by the MTP3 
to mark the route to the affected destination as available, and in the 
case of a signalling transfer point, to send MTP Transfer Allowed (TFA) 
messages to the relevant adjacent SS7 nodes, according to the local SS7 
network procedures.  

For SS7 user part management, it is required that the MTP3-User 
protocols at ASPs receive indications of SS7 signalling point 
availability, SS7 network congestion, and remote User Part 
unavailability as would be expected in an SS7 SEP node.  To accomplish 
this, the MTP-PAUSE, MTP-RESUME and MTP-STATUS indication primitives 
received at the MTP3 upper layer interface at the SG need to be 
propagated to the remote MTP3-User lower layer interface at the ASP. 
(These indication primitives are, of course, also made available to any 
existing local MTP3-Users at the SG, if present.)

Sidebottom et al                                             [Page 15]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


It is important to clarify that MTP3 management messages such as TFPs 
or TFAs received from the SS7 network are not "encapsulated" and sent 
blindly to the ASPs.  Rather, the existing MTP3 management procedures 
are followed within the MTP3 function of the SG to re-calculate the 
MTP3 route set status and initiate any required signalling-route-set-
test procedures into the SS7 network.  Only when an SS7 destination 
status changes are MTP-PAUSE or MTP-RESUME primitives invoked.  These 
primitives can also be invoked due to local SS7 link set conditions as 
per existing MTP3 procedures.

In case where the MTP in the SG undergoes an MTP restart, event 
communication to the concerned ASPs should be handled as follows:

When the SG discovers SS7 network isolation, the SG sends an indication 
to all concerned available ASPs (i.e., ASPs in the "active" or 
"inactive" state), using a DUNA message.  For the purposes of MTP 
Restart, all SPMCs with point codes different from that of the SG with 
at least one ASP that is active or has sent an ASPAC message to the SG 
during the first part of the restart procedure should be considered as 
available.  If the M3UA at the SG receives any ASPAC messages during 
the restart procedure, it delays the ASPAC-ACK messages until the end 
of the restart procedure.  During the second part of the restart 
procedure the M3UA at the SG informs all concerned ASPs in the "active" 
or "inactive" state of any unavailable SS7 destinations.  At the end of 
the restart procedure the M3UA sends an ASPAC-ACK message to all ASPs 
in the "active" state.
 
1.4.3.2 Application Server

A cluster of application servers is responsible for providing the 
overall support for one or more SS7 upper layers.  From an SS7 
standpoint, a Signalling Point Management Cluster (SPMC) provides 
complete support for the upper layer service for a given point code.  
As an example, an SPMC providing MGC capabilities must provide complete 
support for ISUP for a given point code, according to the local SS7 
network specifications.

This measure is necessary to allow the SG to accurately represent the 
signalling point on the local SS7 network.

In the case where an ASP is connected to more than one SG, the M3UA 
must maintain the status of configured SS7 destinations and route 
messages according to availability/congestion status of the routes to 
these destinations.

When an ASP enters the "Inactive" state towards an SG the M3UA must 
mark all SS7 destinations configured to be reachable via this SG as 
available.

When the M3UA at an ASP receives a DUNA message indicating SS7 network 
isolation at an SG, it will stop any affected traffic via this SG and 

Sidebottom et al                                             [Page 16]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


clear any unavailability state of SS7 destinations via this SG. When 
the M3UA subsequently receives any DUNA messages from an SG it will 
mark the effected SS7 destinations as unavailable via that SG.  When 
the M3UA receives an ASPAC-ACK message it can resume traffic to 
available SS7 destinations via this SG, provided the ASP is in the 
active state towards this SG.

1.4.3.3 IPSP

Since IPSPs use M3UA in a point-to-point fashion, there is no concept 
of routing of messages beyond the remote end.  Therefore, SS7 and M3UA 
inter-working is not necessary for this model.

1.4.4 Redundancy Models

The network address translation and mapping function of the M3UA layer 
supports signalling process fail-over functions in order to support a 
high availability of call and transaction processing capability.

1.4.4.1 Application Server Redundancy

All MTP3-User messages (e.g., ISUP, SCCP) incoming to an SG from the 
SS7 network are assigned to a unique Application Server, based on the 
information in the message and the provisioned Routing Keys.

The Application Server is, in practical terms, a list of all ASPs 
configured to process a range of MTP3-User traffic defined by one 
Routing Key.  One or more ASPs in the list are normally active (i.e., 
handling traffic) while any others may be unavailable or inactive, to 
be possibly used in the event of failure or unavailability of the 
active ASP(s).  

The fail-over model supports an "n+k" redundancy model, where "n" ASPs 
is the minimum number of redundant ASPs required to handle traffic and 
"k" ASPs are available to take over for a failed or unavailable ASP.  A  
"1+1" active/standby redundancy is a subset of this model. A simplex 
"1+0" model is also supported as a subset, with no ASP redundancy.

At the SG, an Application Server list contains active and inactive ASPs 
to support ASP load-sharing and fail-over procedures.  The list of ASPs 
within a logical Application Server is kept updated in the SG to 
reflect the active Application Server Process(es).

To avoid a single point of failure, it is recommended that a minimum of 
two ASPs be in the list, resident in separate hosts, and therefore 
available over different SCTP Associations.  For example, in the 
network shown in Figure 1, all messages to DPC x could be sent to ASP1 
in Host1 or ASP1 in Host2.  The AS list at SG1 might look like this:




Sidebottom et al                                             [Page 17]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


    Routing Key {DPC=x) - "Application Server #1"
        ASP1/Host1  - State=Up, Active
        ASP1/Host2  - State=Up, Inactive

In this "1+1" redundancy case, ASP1 in Host1 would be sent any incoming 
message with DPC=x.  ASP1 in Host2 would normally be brought to the 
active state upon failure of, or loss of connectivity to, ASP1/Host1. 
In this example, both ASPs are Up, meaning that the related SCTP 
association and far-end M3UA peer is ready.

The AS List at SG1 might also be set up in load-share mode:

    Routing Key {DPC=x) - "Application Server #1"
        ASP1/Host1 - State = Up, Active
        ASP1/Host2 - State = Up, Active

In this case, both the ASPs would be sent a portion of the traffic.  
For example the two ASPs could together form a database, where incoming 
queries may be sent to any active ASP.

Care must be exercised by a Network Operator in the selection of the 
routing information to be used as the Routing Key for a particular AS.  
For example, where Application Servers are defined using ranges of ISUP 
CIC values, the Operator is implicitly splitting up control of the 
related circuit groups.  Some CIC value range assignments may interfere 
with ISUP circuit group management procedures.  

In the process of fail-over or fail-back, it is recommended that in the 
case of ASPs supporting call processing, stable calls do not fail.  It 
is possible that calls in "transition" may fail, although measures of 
communication between the ASPs involved can be used to mitigate this.  
For example, the two ASPs may share call state via shared memory, or 
may use an ASP to ASP protocol to pass call state information.

1.4.4.2 Signalling Gateway Redundancy

Signalling Gateways may also be distributed over multiple hosts.  Much 
like the AS model, SGs may be comprised of one or more SG Processes 
(SGPs), distributed over one or more hosts, using an active/standby or 
a load-sharing model.  An SGP is viewed as a remote SCTP end-point from 
an ASP perspective.  There is, however, no M3UA protocol to manage the 
status of an SGP. Whenever an SCTP association to an SGP exists, the 
SGP is assumed to be available.  Also, every SGP within an SG 
communicating with an ASP provides identical SS7 connectivity to this 
ASP. Should an SGP lose all or partial SS7 connectivity and other SGPs 
exist, the SGP must terminate the SCTP associations to the concerned 
ASPs.

It is therefore possible for an ASP to route signalling messages 
destined to the SS7 network using more than one SGP.  In this model, a 


Sidebottom et al                                             [Page 18]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


Signalling Gateway is deployed as a cluster of hosts acting as a single 
SG.  A primary/back-up redundancy model is possible, where the 
unavailability of the SCTP association to a primary SGP could be used 
to reroute affected traffic to an alternate SGP.  A load-sharing model 
is possible, where the signalling messages are load-shared between 
multiple SGPs.

It may also be possible for an ASP to use more than one SG to access a 
specific SS7 end point, in a model that resembles an SS7 STP mated 
pair.  Typically, SS7 STPs are deployed in mated pairs, with traffic 
load-shared between them.  Other models are also possible, subject to 
the limitations of the local SS7 network provisioning guidelines.

>From the perspective of the M3UA at an ASP, a particular SG is capable 
of transferring traffic to an SS7 destination if an SCTP association 
with at least one SGP of the SG is established, the SGP has received an 
indication from the ASP M3UA that the ASP is actively handling traffic 
for that destination, and the SG has not indicated that the destination 
is inaccessible.  When an ASP is configured to use multiple SGs for 
transferring traffic to the SS7 network, the ASP must maintain 
knowledge of the current capability of the SGs to handle traffic to 
destinations of interest.  This information is crucial to the overall 
reliability of the service, for both active/standby and load-sharing 
model, in the event of failures, recovery and maintenance activities.  
The ASP M3UA may also use this information for congestion avoidance 
purposes.

1.4.5 Flow Control
Local Management at an ASP may wish to stop traffic across an SCTP 
association in order to temporarily remove the association from service 
or to perform testing and maintenance activity.  The function could 
optionally be used to control the start of traffic on to a newly 
available SCTP association.

1.4.6 Congestion Management

The M3UA Layer is informed of local and IP network congestion by means 
of an implementation-dependent function (e.g., an implementation-
dependent indication from the SCTP of IP network congestion). When an 
SG determines that the transport of SS7 messages to a Signalling Point 
Management Cluster (SPMC) is encountering congestion, the SG should 
trigger SS7 MTP3 Transfer Controlled management messages to originating 
SS7 nodes. The triggering of SS7 MTP3 Management messages from an SG is 
an implementation-dependent function.  

At an ASP, congestion is indicated to local MTP3-Users by means of an 
MTP-Status primitive indicating congestion, to invoke appropriate upper 
layer responses, as per current MTP3 procedures.

The M3UA should indicate local ASP congestion to the SG with an SCON 
message.  When an SG receives an SCON message from an ASP it should

Sidebottom et al                                             [Page 19]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000

trigger SS7 MTP3 Transfer Controlled management messages to concerned 
SS7 destinations according to established MTP procedures.

1.4.7 SCTP Stream Mapping.  

The M3UA at both the SG and ASP also supports the assignment of 
signalling traffic into streams within an SCTP association.  Traffic 
that requires sequencing must be assigned to the same stream.  To 
accomplish this, MTP3-User traffic may be assigned to individual 
streams based on, for example, the SLS value in the MTP3 Routing Label 
or the ISUP CIC assignment, subject of course to the maximum number of 
streams supported by the underlying SCTP association.  

The use of SCTP streams within M3UA is recommended in order to minimize 
transmission and buffering delays, therefore improving the overall 
performance and reliability of the signalling elements.  The 
distribution of the MTP3 user messages over the various streams should 
be done in such a way to minimize message mis-sequencing, as required 
by the SS7 User Parts.

1.4.8 Client/Server Model

The SG takes on the role of server while the ASP is the client. ASPs 
must initiate the SCTP association to the SG.

In the case of IPSP to IPSP communication, one side can be designated 
as the initiator of the SCTP association and M3UA messaging.

The SCTP (and UDP/TCP) Registered User Port Number Assignment for M3UA 
is 2905.























Sidebottom et al                                              [Page 20]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000



1.5 Sample Configurations

1.5.1 Example 1: ISUP message transport

  ********   SS7   *****************   IP   ********
  * SEP  *---------*      SG       *--------* ASP  *
  ********         *****************        ********

  +------+                                  +------+
  | ISUP |               (NIF)              | ISUP |
  +------+         +------+-+------+        +------+
  | MTP3 |         | MTP3 | | M3UA |        | M3UA |
  +------|         +------+ +------+        +------+
  | MTP2 |         | MTP2 | | SCTP |        | SCTP |
  +------+         +------+ +------+        +------+
  |  L1  |         |  L1  | |  IP  |        |  IP  |
  +------+         +------+ +------+        +------+ 
      |_______________|         |______________|

    SEP - SS7 Signalling End Point
    SCTP - Stream Control Transmission Protocol
    NIF - Nodal Inter-working Function

In this example, the SG provides an implementation-dependent nodal 
inter-working function (NIF) that allows the MGC to exchange SS7 
signalling messages with the SS7-based SEP.  The NIF within the SG 
serves as the interface within the SG between the MTP3 and M3UA.  This 
nodal inter-working function has no visible peer protocol with either 
the MGC or SEP.  It also provides network status information to one or 
both sides of the network.

For internal SG modeling purposes, at the NIF level, SS7 signalling 
messages that are destined to the MGC are received as MTP-TRANSFER 
indication primitives from the MTP Level 3 upper layer interface and 
are sent to the local M3UA-resident message distribution function for 
ongoing routing to the final IP destination.  MTP-TRANSFER primitives 
received from the local M3UA network address translation and mapping 
function are sent to the MTP Level 3 upper layer interface as MTP-
TRANSFER request primitives for on-going MTP Level 3 routing to an SS7 
SEP.  For the purposes of providing SS7 network status information the 
NIF also delivers MTP-PAUSE, MTP-RESUME and MTP-STATUS indication 
primitives received from the MTP Level 3 upper layer interface to the 
local M3UA-resident management function.








Sidebottom et al                                              [Page 21]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


1.5.2  Example 2: SCCP Transport between IPSPs

   ********    IP    ********
   * IPSP *          * IPSP *
   ********          ********
  
   +------+          +------+
   |SCCP- |          |SCCP- |
   | User |          | User |
   +------+          +------+
   | SCCP |          | SCCP |
   +------+          +------+
   | M3UA |          | M3UA |
   +------+          +------+
   | SCTP |          | SCTP |
   +------+          +------+
   |  IP  |          |  IP  |
   +------+          +------+
       |________________|

This example shows an architecture where no Signalling Gateway is used.  
In this example, SCCP messages are exchanged directly between two IP-
resident IPSPs with resident SCCP-User protocol instances, such as 
RANAP or TCAP.  SS7 network inter-working is not required, therefore 
there is no MTP3 network management status information for the SCCP and 
SCCP-User protocols to consider.  Any MTP-PAUSE, -RESUME or -STATUS 
indications from the M3UA to the SCCP should consider only the status 
of the SCTP Association and underlying IP network.    
























Sidebottom et al                                             [Page 22]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


1.5.3 Example 3: SG resident SCCP layer, with remote ASP

  ********   SS7   *****************   IP   ********
  * SEP  *---------*               *--------*      *
  *  or  *         *      SG       *        * ASP  *
  * STP  *         *               *        *      *
  ********         *****************        ********

  +------+         +---------------+        +------+
  | SCCP-|         |     SCCP      |        | SCCP-|
  | User |         +---------------+        | User |
  +------+           |   _____   |          +------+
  | SCCP |           |  |     |  |          | SCCP |
  +------+         +------+-+------+        +------+
  | MTP3 |         | MTP3 | | M3UA |        | M3UA |
  +------|         +------+ +------+        +------+
  | MTP2 |         | MTP2 | | SCTP |        | SCTP |
  +------+         +------+ +------+        +------+
  |  L1  |         |  L1  | |  IP  |        |  IP  |
  +------+         +------+ +------+        +------+
      |_______________|         |______________|

    STP - SS7 Signalling Transfer Point

In this example, the SG contains an instance of the SS7 SCCP protocol
layer that may, for example, perform the SCCP Global Title Translation 
(GTT) function for messages logically addressed to the SG SCCP.  If the 
result of a GTT for an SCCP message yields an SS7 DPC or DPC/SSN 
address result of an SCCP peer located in the IP domain, the resulting 
MTP-TRANSFER request primitive is sent to the local M3UA-resident 
network address translation and mapping function for ongoing routing to 
the final IP destination.  

Similarly, the SCCP instance in an SG can perform the SCCP GTT service 
for messages logically addressed to it from SCCP peers in the IP 
domain.  In this case, MTP-TRANSFER messages are sent from the local 
M3UA-resident network address translation and mapping function to the 
SCCP for GTT.  If the result of the GTT yields the address of an SCCP 
peer in the SS7 network then the resulting MTP-TRANSFER request is 
given to the MTP3 for delivery to an SS7-resident node.

It is possible that the above SCCP GTT at the SG could yield the 
address of an SCCP peer in the IP domain and the resulting MTP-TRANSFER 
primitive would be sent back to the M3UA for delivery to an IP 
destination.

For internal SG modeling purposes, this may be accomplished with the 
use of an implementation-dependent nodal inter-working function within 
the SG that effectively sits below the SCCP and routes MTP-TRANSFER 
messages to/from both the MTP3 and the M3UA, based on the SS7 DPC or 
DPC/SSN 

Sidebottom et al                                              [Page 23]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


address information.  This nodal inter-working function has no visible 
peer protocol with either the ASP or SEP.

Note that the services and interface provided by the M3UA are the same 
as in Example 1 and the functions taking place in the SCCP entity are 
transparent to M3UA.  The SCCP protocol functions are not reproduced in 
the M3UA protocol.


1.6 Definition of M3UA Boundaries

1.6.1 Definition of the boundary between M3UA and an MTP3-User.

>From ITU Q.701 [14]:

   MTP-TRANSFER request
   MTP-TRANSFER indication
   MTP-PAUSE indication
   MTP-RESUME indication
   MTP-STATUS indication  

1.6.2 Definition of the boundary between M3UA and SCTP

The upper layer primitives provided by the SCTP are provided in [13]

1.6.3 Definition of the Boundary between M3UA and Layer Management

   M-SCTP ESTABLISH request
   Direction: LM -> M3UA
   Purpose: LM requests ASP to establish an SCTP association with an SG 
            or IPSP.
  	
   M-STCP ESTABLISH confirm 
   Direction: M3UA -> LM
   Purpose: ASP confirms to LM that it has established an SCTP 
            association with an SG or IPSP.

   M-SCTP ESTABLISH indication 
   Direction: M3UA -> LM
   Purpose: M3UA informs LM that a remote ASP has established an SCTP 
            association.

   M-SCTP RELEASE request 
   Direction: LM -> M3UA
   Purpose: LM requests ASP to release an SCTP association with SG or 
            IPSP.

   M-SCTP RELEASE confirm
   Direction: M3UA -> LM
   Purpose: ASP confirms to LM that it has released SCTP association 
            with SG.

Sidebottom et al                                             [Page 24]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


   M-SCTP RELEASE indication
   Direction: M3UA -> LM
   Purpose: M3UA informs LM that a remote ASP has released an SCTP 
            Association or the SCTP association has failed.

   M-SCTP STATUS request 
   Direction: LM -> M3UA
   Purpose: LM requests M3UA to report the status of an SCTP 
            association.

   M-SCTP STATUS confirm 
   Direction: M3UA -> LM
   Purpose: M3UA reports the status of an SCTP association.

   M-ASP STATUS request 
   Direction: LM -> M3UA
   Purpose: LM requests M3UA to report the status of a local or remote 
            ASP.

   M-ASP STATUS confirm 
   Direction: M3UA -> LM
   Purpose: M3UA reports status of local or remote ASP.

   M-AS STATUS request 
   Direction: LM -> M3UA
   Purpose: LM requests M3UA to report the status of an AS.

   M-AS STATUS confirm 
   Direction: M3UA -> LM
   Purpose: M3UA reports the status of an AS.

   M-NOTIFY indication 
   Direction: M3UA -> LM
   Purpose: M3UA reports that it has received a NOTIFY message 
            from its peer.

   M-ERROR indication 
   Direction: M3UA -> LM
   Purpose: M3UA reports that it has received an ERROR message from 
            its peer or that a local operation has been unsuccessful.

   M-ASP UP request 
   Direction: LM -> M3UA
   Purpose: LM requests ASP to start its operation and send an ASP-UP
            Message to its peer.

   M-ASP UP confirm
   Direction: M3UA -> LM
   Purpose: M3UA confirms requested ASP-UP change has been successfully
            acknowledged by the M3UA peer.


Sidebottom et al                                             [Page 25]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


   M-ASP UP indication
   Direction: M3UA -> LM
   Purpose: M3UA reports it has successfully processed an incoming ASP-
            UP request from its peer.

   M-ASP DOWN request 
   Direction: LM -> M3UA
   Purpose: LM requests ASP to stop its operation and send an ASP-DOWN 
            Message to its peer.

   M-ASP DOWN confirm
   Direction: M3UA -> LM
   Purpose: M3UA confirms requested ASP-DOWN change has been 
            successfully acknowledged by the M3UA peer.

   M-ASP DOWN indication
   Direction: M3UA -> LM
   Purpose: M3UA reports it has successfully processed an incoming ASP-
            DOWN request from its peer.

   M-ASP-ACTIVE request
   Direction: LM -> M3UA
   Purpose: LM requests ASP to send an ASP-ACTIVE message to its peer 
            and to start data transfer.

   M-ASP ACTIVE confirm
   Direction: M3UA -> LM
   Purpose: LM confirms requested ASP-ACTIVE change has been 
            successfully acknowledged by the M3UA peer.

   M-ASP ACTIVE indication
   Direction: M3UA -> LM
   Purpose: LM reports it has successfully processed an incoming ASP-
            ACTIVE request from its peer.

   M-ASP-INACTIVE request
   Direction: LM -> M3UA
   Purpose: LM requests ASP to stop data transfer and send an ASP-
            Inactive message to the SG.

   M-ASP INACTIVE confirm
   Direction: LM -> M3UA
   Purpose: LM confirms requested ASP-INACTIVE change has been 
            successfully acknowledged by the M3UA peer.

   M-ASP INACTIVE indication
   Direction: M3UA -> LM
   Purpose: LM reports it has successfully processed an incoming ASP-
            INACTIVE request from its peer.



Sidebottom et al                                             [Page 26]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


   M-AS ACTIVE indication
   Direction: M3UA -> LM
   Purpose: LM reports that an AS has moved to the ACTIVE state.

   M-AS INACTIVE indication
   Direction: M3UA -> LM
   Purpose: LM reports that an AS has moved to the INACTIVE state.

   M-AS DOWN indication
   Direction: M3UA -> LM
   Purpose: LM reports that an AS has moved to the DOWN state.


2.0 Conventions

The keywords MUST, MUST NOT, REQUIRED, SHALL, SHALL NOT, SHOULD, SHOULD 
NOT, RECOMMENDED, NOT RECOMMENDED, MAY, and OPTIONAL, when they appear 
in this document, are to be interpreted as described in [RFC2119].


3.0 M3UA Protocol Elements

The general M3UA message format includes a Common Message Header 
followed by zero or more parameters as defined by the Message Type.  
For forward compatibility, all Message Types may have attached 
parameters even if none are specified in this version.

3.1 Common Message Header

The protocol messages for MTP3-User Adaptation require a message 
structure that contains a version, message type, message length, and 
message contents.  This message header is common among all signalling 
protocol adaptation layers:


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    Version    |   Reserved    | Message Class | Message Type  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        Message Length                         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                                                               /

All fields in an M3UA message MUST be transmitted in the network byte 
order, unless otherwise stated.





Sidebottom et al                                             [Page 27]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


M3UA Protocol Version: 8 bits (unsigned integer)

   The version field contains the version of the M3UA adaptation layer.  
   The supported versions are:

         1      Release 1.0

Message Class: 8 bits (unsigned integer)

   The following list contains the Message Type Classes for the defined 
   messages.

         0        Management (MGMT) Message
         1        Transfer Messages
         2        SS7 Signalling Network Management (SSNM) Messages
         3        ASP State Maintenance (ASPSM) Messages
         4        ASP Traffic Maintenance (ASPTM) Messages
      5 to 255    Reserved

Message Type: 8 bits (unsigned integer)

   The following list contains the message types for the defined 
   messages.

     Management (MGMT) Message

         0        Error (ERR)
         1        Notify (NTFY)
       2 to 255   Reserved for Management Messages     

     Transfer Messages

         0        Reserved
         1        Payload Data (DATA)
       2 to 255   Reserved for Transfer Messages

     SS7 Signalling Network Management (SSNM) Messages

         0        Reserved
         1        Destination Unavailable (DUNA)
         2        Destination Available (DAVA)
         3        Destination State Audit (DAUD)
         4        SS7 Network Congestion State (SCON)
         5        Destination User Part Unavailable (DUPU)
       6 to 255   Reserved for SSNM Messages            







Sidebottom et al                                             [Page 28]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000   


  ASP State Maintenance (ASPSM) Messages

         0        Reserved
         1        ASP Up (UP)
         2        ASP Down (DOWN)         
         3        Heartbeat (BEAT)
         4        ASP Up Ack (UP ACK)
         5        ASP Down Ack (DOWN ACK)
         6        Heatbeat Ack (BEAT ACK)
 
       7 to 255   Reserved for ASPSM Messages

  ASP Traffic Maintenance (ASPTM) Messages

         0        Reserved
         1        ASP Active (ACTIVE)
         2        ASP Inactive (INACTIVE)
         3        ASP Active Ack (ACTIVE ACK) 
         4        ASP Inactive Ack (INACTIVE ACK)
       5 to 255   Reserved for ASPTM Messages

Reserved: 8 bits

   Should be set to all '0's and ignored by the receiver.

Message Length: 32-bits (unsigned integer)

   The Message Length defines the length of the message in octets, 
   including the header.


3.2 Variable-Length Parameter Format

M3UA messages consist of a Common Header followed by zero or more 
parameters, as defined by the message type.  The variable-length 
parameters contained in a message are defined in a Tag-Length-Value 
format as shown below.  

   0                   1                   2                   3
   0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
  +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
  |          Parameter Tag        |       Parameter Length        |
  +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
  \                                                               \
  /                       Parameter Value                         /
  \                                                               \
  +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+





Sidebottom et al                                             [Page 29]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


Parameter Tag: 16 bits (unsigned integer)

   Tag field is a 16-bit identifier of the type of parameter. It takes 
   a value of 0 to 65534. 

   The value of 65535 is reserved for IETF-defined extensions.  Values 
   other than those defined in specific parameter description are 
   reserved for use by the IETF. 

Parameter Length: 16 bits (unsigned integer)

   The Parameter Length field contains the size of the parameter in 
   bytes, including the Parameter Tag, Parameter Length, and Parameter 
   Value fields. The Parameter Length does not include any padding 
   bytes.

Parameter Value: variable-length.

   The Parameter Value field contains the actual information to be 
   transferred in the parameter. 

   The total length of a parameter (including Tag, Parameter Length and 
   Value fields) MUST be a multiple of 4 bytes. If the length of the 
   parameter is not a multiple of 4 bytes, the sender pads the 
   Parameter at the end (i.e., after the Parameter Value field) with 
   all zero bytes. The length of the padding is NOT included in the 
   parameter length field. A sender should NEVER pad with more than 3 
   bytes. The receiver MUST ignore the padding bytes.


3.3 Transfer Messages

The following section describes the Transfer messages and parameter 
contents. 

3.3.1 Payload Data Message (DATA)

The Data message contains the SS7 MTP3-User protocol data, which is an 
MTP-TRANSFER primitive, including the complete MTP3 Routing Label. The 
Data message contains the following variable length parameters:

     Network Appearance    Optional
     Protocol Data         Mandatory









Sidebottom et al                                             [Page 30]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000   


The following format MUST be used for the Data Message:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 1            |          Length = 8           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       Network Appearance*                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 3            |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                        Protocol Data                          /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


Network Appearance: 32-bits (unsigned integer)

   The optional Network Appearance parameter identifies the SS7 network 
   context for the message, for the purposes of logically separating 
   the signalling traffic between the SG and the Application Server 
   Process over a common SCTP Association.  An example is where an SG 
   is logically partitioned to appear as an element in four different 
   national SS7 networks.

   In a Data message, the Network Appearance implicitly defines the SS7 
   Point Code format used, the SS7 Network Indicator value, and the 
   MTP3/MTP3-User protocol type/variant/version used within the SS7 
   network partition.  Where an SG operates in the context of a single 
   SS7 network, or individual SCTP associations are dedicated to each 
   SS7 network context, the Network Appearance parameter is not 
   required.

   The Network Appearance parameter value is of local significance 
   only, coordinated between the SG and ASP.

   Where the optional Network Appearance parameter is present, it must 
   be the first parameter in the message as it defines the format of 
   the Protocol Data field.

Protocol Data: variable length

   The Protocol Data field contains the SS7 MTP3-User application 
   message, including the Service Information Octet and Routing Label. 
   The Protocol Data parameter contains the following fields:





Sidebottom et al                                             [Page 31]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


       Service Information Octet. Includes:
            Service Indicator, 
            Network Indicator,
            and Spare/Priority codes

       Routing Label. Includes:
            Destination Point Code,
            Originating Point Code,
            And Signalling Link Selection Code (SLS)

       User Protocol Data.  Includes MTP3-User protocol elements:
            ISUP, SCCP, or TUP parameters
       

   The format is as defined in the relevant MTP standards for the SS7 
   protocol being transported.  The format is either implicitly known 
   or identified by the Network Appearance parameter.

   For the ANSI protocol example, the Protocol Data field format is 
   shown below:


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      SIO      |  DPC Network  |  DPC Cluster  |  DPC Member   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  OPC Network  |  OPC Cluster  |  OPC Member   |      SLS      | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                        Protocol Data                          /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   |MSB---------------------------------------------------------LSB|


   For the ITU international protocol example, the Protocol Data field 
   is shown below.














Sidebottom et al                                             [Page 32]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      SIO      | DPC |      DPC      | DPC | OPC |     OPC     |
   |               |Zone |     Region    | SP  |Zone |    Region   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |*| OPC |  SLS  |                                               |
   |*| SP  |       |                                               |
   +-+-+-+-+-+-+-+-+                                               +
   \                                                               \
   /                        Protocol Data                          /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   |MSB---------------------------------------------------------LSB|

       * LSB of OPC Region


3.4 SS7 Signalling Network Management (SSNM) Messages

3.4.1 Destination Unavailable (DUNA)

The DUNA message is sent from the SG to all concerned ASPs to indicate 
that the SG has determined that one or more SS7 destinations are 
unreachable.  It is also sent in response to a message from the ASP to 
an unreachable SS7 destination.  The MTP3-User at the ASP is expected 
to stop traffic to the affected destination through the SG initiating 
the DUNA as per the defined MTP3-User procedures. 

The DUNA message contains the following parameters:

     Network Appearance      Optional
     Affected Destinations   Mandatory
     Info String             Optional

















Sidebottom et al                                             [Page 33]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


The format for DUNA Message parameters is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |            Tag = 1            |           Length =8           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Network Appearance*                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 5            |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    Mask      |                 Affected DPC 1                |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                              ...                              /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    Mask      |                 Affected DPC n                |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |             Tag = 4           |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                          INFO String*                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


Network Appearance: 32-bit unsigned integer

   The optional Network Appearance parameter identifies the SS7 network 
   context for the message, for the purposes of logically separating 
   the signalling traffic between the SG and the Application Server 
   Process over a common SCTP Association.  An example is where an SG 
   is logically partitioned to appear as an element in four different 
   national SS7 networks.  

   In an SSNM message, the Network Appearance parameter defines the 
   format of the Affected DPC(s) in the Affected Destination parameter.  
   The DPC point code length (e.g., 14-, 16-, or 24-bit) and sub-field 
   definitions (e.g., ANSI 24-bit network/cluster/member, ITU-
   international 14-bit zone/region/signal_point, many national field 
   variants, ...) are fixed within a particular Network Appearance.  
   Where an SG operates in the context of a single SS7 network, or 
   individual SCTP associations are dedicated to each SS7 network 
   context, the Network Appearance parameter is not required and the 
   format of the Affected DPC(s) is understood implicitly.

   The format of the Network Appearance parameter is an integer, the 
   values used are of local significance only, coordinated between the 
   SG and ASP.


Sidebottom et al                                             [Page 34]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


   Where the optional Network Appearance parameter is present, it must 
   be the first parameter in the message as it defines the format of 
   the Affected DPCs in the Affected Destination parameter.

Affected Destinations: n x 32-bits

   The Affected Destinations parameter contains up to sixteen Affected 
   Destination Point Code fields, each a three-octet parameter to allow 
   for 14-, 16- and 24-bit binary formatted SS7 Point Codes.  Affected 
   Point Codes that are less than 24-bits, are padded on the left to 
   the 24-bit boundary.  The encoding is shown below for ANSI and ITU 
   Point Code examples.

   ANSI 24-bit Point Code:

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |     Mask      |    Network    |    Cluster    |     Member    |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                      |MSB-----------------------------------------LSB|

   ITU 14-bit Point Code:

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |     Mask      |0 0 0 0 0 0 0 0 0 0|Zone |     Region    | SP  |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                                           |MSB--------------------LSB|

   It is optional to send an Affected Destinations parameter with more 
   than one Affected DPC but it is mandatory to receive and process it.  
   All the Affected DPCs included must be within the same Network 
   Appearance.  Including multiple Affected DPCs may be useful when 
   reception of an MTP3 management message or a linkset event 
   simultaneously affects the availability status of a list of 
   destinations at an SG.  

Mask: 8-bits (unsigned integer)

   The Mask field associated with each Affected DPC in the Affected 
   Destinations parameter, used to identify a contiguous range of 
   Affected Destination Point Codes, independent of the point code 
   format.  Identifying a contiguous range of Affected DPCs may be 
   useful when reception of an MTP3 management message or a linkset 
   event simultaneously affects the availability status of a series of 
   destinations at an SG.  For example, if all DPCs in an ANSI cluster 


Sidebottom et al                                             [Page 35]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000

   are determined to be unavailable due to local linkset 
   unavailability, the DUNA could identify potentially 256 Affected 
   DPCs in a single Affected DPC field. 

   The Mask parameter represents a bit mask that can be applied to the 
   related Affected DPC field.  The bit mask identifies how many bits 
   of the Affected DPC field are significant and which are effectively 
   "wildcarded".  For example, a mask of "8" indicates that the last 
   eight bits of the DPC is "wildcarded".  For an ANSI 24-bit Affected 
   DPC, this is equivalent to signalling that all DPCs in an ANSI 
   Cluster are unavailable.  A mask of "3" indicates that the last 
   three bits of the DPC is "wildcarded".  For a 14-bit ITU Affected 
   DPC, this is equivalent to signaling that an ITU Region is 
   unavailable. A mask value equal to the number of bits in the DPC 
   indicates that the entire network appearance is affected - this is 
   used to indicate network isolation to the ASP.

Info String: variable length

   The optional INFO String parameter can carry any meaningful 8-BIT 
   ASCII character string along with the message.  Length of the INFO 
   String parameter is from 0 to 255 characters.  No procedures are 
   presently identified for its use but the INFO String may be used by 
   Operators to identify in text form the location reflected by the 
   Affected DPC for debugging purposes.

3.4.2 Destination Available (DAVA)   

The DAVA message is sent from the SG to all concerned ASPs to indicate 
that the SG has determined that one or more SS7 destinations are now 
reachable, or in response to a DAUD message if appropriate. The ASP 
MTP3-User protocol is expected to resume traffic to the affected 
destination through the SG initiating the DUNA. 

The DAVA message contains the following parameters:

     Network Appearance       Optional
     Affected Destinations    Mandatory
     Info String              Optional

The format and description of the Network Appearance, Affected 
Destinations and Info String parameters is the same as for the DUNA 
message (See Section 3.4.1.)  

3.4.3 Destination State Audit (DAUD)

The DAUD message can be sent from the ASP to the SG to audit the 
availability/congestion state of SS7 routes to one or more affected 
destinations.  




Sidebottom et al                                             [Page 36]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000

The DAUD message contains the following parameters:

     Network Appearance      Optional
     Affected Destinations   Mandatory
     Info String             Optional

The format and description of DAUD Message parameters is the same as 
for the DUNA message (See Section 3.4.1.)

3.4.4 SS7 Network Congestion (SCON)

The SCON message can be sent from the SG to all concerned ASPs to 
indicate congestion in the SS7 network to one or more destinations, or 
to an ASP in response to a DATA or DAUD message as appropriate.  For 
some MTP protocol variants (e.g., ANSI MTP) the SCON may be sent when 
the SS7 congestion level changes.  The SCON message MAY also be sent 
from the M3UA of an ASP to an M3UA peer indicating that the M3UA or the 
ASP is congested.

The SCON message contains the following parameters:

     Network Appearance       Optional
     Affected Destinations    Mandatory
     Congestion Indications   Optional           
     Info String              Optional

The format for SCON Message parameters is as follows:


























Sidebottom et al                                             [Page 37]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 1            |           Length =8           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                       Network Appearance*                     | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 5            |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      Mask     |                 Affected DPC 1                |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                              ...                              /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      Mask     |                 Affected DPC n                |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 14           |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                   Reserved                    |  Cong. Level* |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 4            |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                         INFO String*                          /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


The format and description of the Network Appearance, Affected 
Destinations, and Info String parameters is the same as for the DUNA 
message (See Section 3.4.1.)

The Affected Destinations parameter can be used to indicate congestion 
of multiple destinations or ranges of destinations.  However, an SCON 
MUST not be delayed in order to "collect" individual congested 
destinations into a single SCON as any delay might affect the timing of 
congestion indications to the M3UA Users.  One use for including a 
range of Congested DPCs is when the SG supports an ANSI cluster route 
set to the SS7 network that becomes congested due to outgoing link set 
congestion. 

Congested Indications: 32-bits

   The optional Congestion Indications parameter contains a Congestion 
   Level field.  This optional parameter is used to communicate 
   congestion levels in national MTP networks with multiple congestion 
   thresholds, such as in ANSI MTP3.  For MTP congestion methods 
   without multiple congestion levels (e.g., the ITU international 
   method) the parameter is not included.


Sidebottom et al                                             [Page 38]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


Congestion Level field: 8-bits (unsigned integer)

   The Congestion Level field, associated with all of the Affected 
   DPC(s) in the Affected Destinations parameter, contains one of the 
   Following values:

         0     No Congestion or Undefined
         1     Congestion Level 1
         2     Congestion Level 2
         3     Congestion Level 3

   The congestion levels are defined in the congestion method in the 
   appropriate national MTP recommendations [14,15]. 


3.4.5 Destination User Part Unavailable (DUPU)

The DUPU message is used by an SG to inform an ASP that a remote peer 
MTP3-User Part (e.g., ISUP or SCCP) at an SS7 node is unavailable.

The DUPU message contains the following parameters:

     Network Appearance       Optional
     Affected Destinations    Mandatory
     User/Cause               Mandatory
     Info String              Optional

The format for DUPU Message parameters is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 1            |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                      Network Appearance*                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 5            |          Length = 8           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Mask = 0    |                  Affected DPC                 |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 9            |          Length = 8           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |             Cause             |            User               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 4            |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                          INFO String*                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


Sidebottom et al                                             [Page 39]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


User/Cause: 32-bits

   The Unavailability Cause and MTP3-User Identity fields, associated 
   with the Affected DPC in the Affected Destinations parameter, are 
   encoded as follows:

Unavailability Cause field: 16-bits (unsigned integer)

   The Unavailability Cause parameter provides the reason for the 
   unavailability of the MTP3-User.  The valid values for the 
   Unavailability Cause parameter are shown in the following table. 
   The values agree with those provided in the SS7 MTP3 User Part 
   Unavailable message.  Depending on the MTP3 protocol used in the 
   network appearance, additional values may be used - the 
   specification of the relevant MTP3 protocol variant/version 
   recommendation is definitive.

         0         Unknown
         1         Unequipped Remote User
         2         Inaccessible Remote User

MTP3-User Identity field: 16-bits (unsigned integer)

   The MTP3-User Identity describes the specific MTP3-User that is 
   unavailable (e.g., ISUP, SCCP, ...).  Some of the valid values for 
   the MTP3-User Identity are shown below.  The values agree with those 
   provided in the SS7 MTP3 User Part Unavailable message and Service 
   Indicator.  Depending on the MTP3 protocol variant/version used in 
   the network appearance, additional values may be used.  The relevant 
   MTP3 protocol variant/version recommendation is definitive.

       0 to 2       Reserved
          3         SCCP
          4         TUP
          5         ISUP
       6 to 8       Reserved
          9         Broadband ISUP
          10        Satellite ISUP           
 
The Affected Destinations parameter in a DUPU message differs from the 
Affected Destinations parameter in the DUNA, DAVA, and DAUD in that the 
Mask field is not used and only a single Affected DPC is attached.  
Ranges and lists of Affected DPCs cannot be signaled, but this is 
consistent with operation in the SS7 network. The Affected Destinations 
parameter in an MTP3 User Part Unavailable message (UPU) received by an 
SG from the SS7 network contains only one destination.

The format and description of the Network Appearance and Info String 
parameters is the same as for the DUNA message (See Section 3.4.1.).



Sidebottom et al                                             [Page 40]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


3.5 Application Server Process Maintenance (ASPM) Messages

3.5.1 ASP Up (ASPUP)

The ASP UP (ASPUP) message is used to indicate to a remote M3UA peer 
that the Adaptation layer is ready to receive  SSNM or ASPM management 
messages for all Routing Keys that the ASP is configured to serve.

The ASPUP message contains the following parameters:

     INFO String                   Optional

The format for ASPUP Message parameters is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 4            |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                          INFO String*                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


The format and description of the optional Info String parameter is the 
same as for the DUNA message (See Section 3.4.1.)


3.5.2 ASP Up Ack

The ASP UP Ack message is used to acknowledge an ASP-Up message 
received from a  remote M3UA peer.

The ASPUP Ack message contains the following parameters:

     INFO String (optional)

The format for ASPUP Ack Message parameters is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag =4            |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                          INFO String*                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+



Sidebottom et al                                             [Page 41]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


The format and description of the optional Info String parameter is the 
same as for the DUNA message (See Section 3.4.1.)


3.5.3 ASP Down (ASPDN)

The ASP Down (ASPDN) message is used to indicate to a remote M3UA peer 
that the adaptation layer is not ready to receive traffic or management 
messages.

The ASPDN message contains the following parameters:

     Reason         Mandatory
     INFO String    Optional

The format for the ASPDN message parameters is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |           Tag = 10            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |                              Reason                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag =4             |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   \                                                               \
   /                         INFO String*                          /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


The format and description of the optional Info String parameter is the 
same as for the DUNA message (See Section 3.4.1.)

Reason: 32-bit (unsigned integer)

   The Reason parameter indicates the reason that the remote M3UA 
   adaptation layer is unavailable.  The valid values for Reason are 
   shown in the following table.

         0       Unspecified
         1       User Unavailable
         2       Management Blocking

3.5.4 ASP Down Ack

The ASP Down Ack message is used to acknowledge an ASP-Down message 
received from a remote M3UA peer.



Sidebottom et al                                             [Page 42]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


The ASP Down Ack message contains the following parameters:

     Reason          Mandatory
     INFO String     Optional

The format for the ASPDN Ack message parameters is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |           Tag = 10            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                              Reason                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 4            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   \                                                               \
   /                         INFO String*                          /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

The format and description of the optional Info String parameter is the 
same as for the DUNA message (See Section 3.4.1.)

The format of the Reason parameter is the same as for the ASP-Down 
message. (See Section 3.4.3)


3.5.5 ASP Active (ASPAC)

The ASPAC message is sent by an ASP to indicate to a remote M3UA peer  
that it is Active and ready to process signalling traffic for a 
particular Application Server.  The ASPAC affects only the ASP state 
for the routing keys identified by the Routing Contexts, if present.

The ASPAC message contains the following parameters:

     Traffic Mode Type     Mandatory
     Routing Context       Optional
     INFO String           Optional












Sidebottom et al                                             [Page 43]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


The format for the ASPAC message is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |           Tag = 11            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Traffic Mode Type                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag =6             |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                       Routing Context*                        / 
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |          Tag = 4              |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                          INFO String*                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


Traffic Mode Type: 32-bit (unsigned integer)

   The Traffic Mode Type parameter identifies the traffic mode of 
   operation of the ASP within an AS. The valid values for Type are 
   shown in the following table.

         1         Over-ride
         2         Load-share
         3         Over-ride (Standby)
         4         Load-share (Standby)

   Within a particular Routing Context, Over-ride and Load-share Types 
   cannot be mixed.  The Over-ride value indicates that the ASP is 
   operating in Over-ride mode, and the ASP wishes to take over all 
   traffic in an Application Server (i.e., primary/back-up operation), 
   over-riding any currently active ASP in the AS.  In Load-share mode, 
   the ASP wishes to share in the traffic distribution with any other 
   currently active ASPs.  The Standby versions of the Over-ride and 
   Load-share Types indicate that the ASP is declaring itself ready to 
   accept traffic but leaves it up to the sender as to when the traffic 
   is started.  Over-ride (Standby) indicates that the traffic sender 
   continues to use the currently active ASP until it can no longer 
   send/receive traffic (i.e., the currently active ASP transitions to 
   Down or Inactive).  At this point the sender may immediately move 
   the ASP to Active and commence traffic.  Load-share (Standby) is 
   similar - the sender continues to load-share to the current ASPs 
   until there it is determined that there is insufficient resources in 
 

Sidebottom et al                                             [Page 44]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


   the Load-share group.  When there is insufficient ASPs, the sender 
   may immediately move the ASP to Active.


Routing Context: 

   The optional Routing Context parameter contains (a list of) 4-byte 
   unsigned integers indexing the Application Server traffic that the 
   sending ASP is configured/registered to receive.  

   There is one-to-one relationship between an index entry and an SG 
   Routing Key or AS Name.  Because an AS can only appear in one 
   Network Appearance, the Network Appearance parameter is not required 
   in the ASPAC message.

   An Application Server Process may be configured to process traffic 
   for more than one logical Application Server.  From the perspective 
   of an ASP, a Routing Context defines a range of signalling traffic 
   that the ASP is currently configured to receive from the SG.  For 
   example, an ASP could be configured to support call processing for 
   multiple ranges of PSTN trunks and therefore receive related 
   signalling traffic, identified by separate SS7 DPC/OPC/CIC_ranges. 

The format and description of the optional Info String parameter is the 
same as for the DUNA message (See Section 3.4.1.)


3.5.6 ASP Active Ack

The ASPAC Ack message is used to acknowledge an ASP-Active message 
received from a remote M3UA peer.

The ASPAC Ack message contains the following parameters:

     Traffic Mode Type     Mandatory
     Routing Context       Optional
     INFO String           Optional















Sidebottom et al                                             [Page 45]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


The format for the ASPAC Ack message is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |           Tag = 11            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Traffic Mode Type                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 6            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                       Routing Context*                        / 
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |            Tag = 4            |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                          INFO String*                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


The format and description of the optional Info String parameter is the 
same as for the DUNA message (See Section 3.3.2.1.)

The format of the Traffic Mode Type and Routing Context parameters is 
the same as for the ASP-Active message. (See Section 3.4.5).


3.5.7  ASP Inactive (ASPIA)

The ASPIA message is sent by an ASP to indicate to a remote M3UA peer 
that it is no longer processing signalling traffic within a particular 
Application Server.  The ASPIA affects only the ASP state in the 
Routing Keys identified by the Routing Contexts, if present. 

The ASPIA message contains the following parameters:

     Traffic Mode Type       Mandatory
     Routing Context         Optional
     INFO String             Optional










Sidebottom et al                                             [Page 46]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


The format for the ASPIA message parameters is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |            Tag = 11           |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Traffic Mode Type                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 6            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                       Routing Context*                        / 
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |            Tag = 4            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                          INFO String*                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


Traffic Mode Type: 32-bit (unsigned integer)

   The Traffic Mode Type parameter identifies the traffic mode of 
   operation of the ASP within an AS. The valid values for Type are 
   shown in the following table.

      1            Over-ride
      2            Load-share

   Within a particular Routing Context, only one Type can be used.  The 
   Over-ride value indicates that the ASP is operating in Over-ride 
   mode, and will no longer handle traffic within an Application Server 
   (i.e., it is now a backup in a primary/back-up arrangement).  The 
   Load-share value indicates that the ASP is operating in Load-share 
   mode and will no longer share in the traffic distribution with any 
   other currently active ASPs.

   A node that receives an ASPIA with an incorrect Type for a 
   particular routing Context will respond with an Error Message 
   (Cause: Invalid Traffic Handling Mode).

The format and description of the optional Routing Context and Info 
String parameters is the same as for the ASPAC message (See Section 
3.5.5.)





Sidebottom et al                                             [Page 47]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


3.5.8 ASP Inactive Ack

The ASPIA Ack message is used to acknowledge an ASP-Inactive message 
received from a remote M3UA peer.

The ASPIA Ack message contains the following parameters:

     Traffic Mode Type     Mandatory
     Routing Context       Optional
     INFO String           Optional

The format for the ASPIA Ack message is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |           Tag = 11            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Traffic Mode Type                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 6            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                       Routing Context*                        / 
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |            Tag = 4            |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                          INFO String*                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


The format and description of the optional Info String parameter is the 
same as for the DUNA message (See Section 3.4.1.)

The format of the Traffic Mode Type and Routing Context parameters is 
the same as for the ASP-Inactive message. (See Section 3.5.7).


3.5.9 Heartbeat (BEAT)

The Heartbeat message is optionally used to ensure that the M3UA peers 
are still available to each other.  It is recommended for use when the 
M3UA runs over a transport layer other than the SCTP, which has its own 
heartbeat.





Sidebottom et al                                             [Page 48]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


The BEAT message contains the following parameters:

     Heatbeat Data         Optional

The format for the BEAT message is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |            Tag = 8            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                       Heartbeat Data *                        /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

The Heartbeat Data parameter contents are defined by the sending node.  
The Heartbeat Data could include, for example, a Heartbeat Sequence 
Number and/or Timestamp.  The receiver of a Heartbeat message does not 
process this field as it is only of significance to the sender.  The 
receiver MUST respond with a BEAT-Ack message.
  

3.5.10 Heartbeat Ack (Beat-Ack)

The Heartbeat Ack message is sent in response to a received Heartbeat 
message.  It includes all the parameters of the received Heartbeat 
message, without any change.


3.6  Management Messages

3.6.1  Error (ERR)

The Error message is used to notify a peer of an error event associated 
with an incoming message.  For example, the message type might be 
unexpected given the current state, or a parameter value might be 
invalid.  

The ERR message contains the following parameters:

     Error Code                 Mandatory
     Diagnostic Information     Optional









Sidebottom et al                                             [Page 49]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


The format for the ERR message is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 12           |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                          Error Code                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            Tag = 7            |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                     Diagnostic Information*                   /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


Error Code: 32-bits (unsigned integer)

   The Error Code parameter indicates the reason for the Error Message. 
   The Error parameter value can be one of the following values:

     1      Invalid Version 
     2      Invalid Network Appearance 
     3      Unsupported Message Type
     4      Invalid Message Type 
     5      Invalid Traffic Handling Mode 
     6      Unexpected Message
     7      Protocol Error
     8      Invalid Routing Context

Diagnostic Information: variable length

   When included, the optional Diagnostic information can be any 
   information germane to the error condition, to assist in 
   identification of the error condition.  In the case of an Invalid 
   Network Appearance, Traffic Handling Mode or Routing Context, the 
   Diagnostic information includes the received parameter.  In the 
   other cases, the Diagnostic information may be the first 40 bytes of 
   the offending message.

   In the case of an Invalid Version Error Code, the Common Header 
   contains the supported Version.

Error messages are not generated in response to other Error messages.


3.6.2 Notify (NTFY)

The Notify message used to provide an autonomous indication of M3UA 
events to an M3UA peer.  

Sidebottom et al                                             [Page 50]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


The NTFY message contains the following parameters:

     Status Type/ID              Mandatory
     Routing Context            Optional
     INFO String                Optional

The format for the NTFY message is as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |          Tag = 13             |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |        Status Type            |    Status Identification      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |          Tag = 6              |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                       Routing Context*                        / 
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
   |          Tag = 4              |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   \                                                               \
   /                          INFO String*                         /
   \                                                               \
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


Status Type: 16-bits (unsigned integer)

   The Status Type parameter identifies the type of the Notify message.  
   Following are the valid Status Type values:

         1     Application Server State Change (AS-StateChange)
         2     Other 

Status Information: 16-bits (unsigned integer)

   The Status Information parameter contains more detailed information 
   for the notification, based on the value of the Status Type.  

   If the Status Type is AS_State_Change the following Status 
   Information values are used:

         1    reserved
         2    Application Server Inactive (AS-Inactive)
         3    Application Server Active (AS-Active)
         4    Application Server Pending (AS-Pending)

   

Sidebottom et al                                             [Page 51]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


   These notifications are sent from an SG to an ASP upon a change in 
   status of a particular Application Server. The value reflects the 
   new state of the Application Server.

   If the Status Type is Other, then the following Status Information 
   values are defined:

         1    Insufficient ASP resources active in AS
         2    Alternate ASP Active


These notifications are not based on the SG reporting the state change 
of an ASP or AS.  In the Insufficent ASP Resources case, the SG is 
indicating to an "Inactive" ASP(s) in the AS that another ASP is 
required in order to handle the load of the AS (Load-sharing mode).  
For the Alternate ASP Active case, an ASP is informed when an alternate 
ASP transitions to the ASP-Active state in Over-ride mode.  

The format and description of the optional Routing Context and Info 
String parameters is the same as for the ASPAC message (See Section 
3.4.6.)































Sidebottom et al                                             [Page 52]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


4.0 Procedures

The M3UA layer needs to respond to various local primitives it receives 
from the SCTP and M3UA-User layers and Layer Management as well as the 
messages that it receives from the peer M3UA layers.  This section 
describes the M3UA procedures in response to these events.


4.1 Procedures to support the services of the M3UA layer

4.1.1 Receipt of primitives from the M3UA-User

On receiving an MTP-Transfer request primitive from an upper layer, or 
the nodal inter-working function at an SG, the M3UA layer sends a 
corresponding DATA message (see Section 3) to its M3UA peer.  The M3UA 
peer receiving the Data message sends an MTP-Transfer indication 
primitive to the upper layer.

The M3UA address translation and mapping function determines the 
Application Server (AS) based on the information in the incoming 
message.  From the list of ASPs within the AS table, an Active ASP is 
selected and a DATA message is constructed and issued on the 
corresponding SCTP Association.  If more than one ASP is active (i.e., 
traffic is to be load-shared across all the active ASPs), one of the 
active ASPs from the list is selected.  The selection algorithm is 
implementation dependent but could, for example, be round-robin or 
based on, for example, the SLS or ISUP CIC.  The appropriate selection 
algorithm must be chosen carefully as it is dependent on application 
assumptions and understanding of the degree of state coordination 
between the active ASPs in the AS. 

In addition, the message needs to be sent on the appropriate SCTP 
stream, again taking care to meet the message sequencing needs of the 
signalling application. 


4.1.2 Receipt of primitives from the Layer Management

On receiving primitives from the local Layer Management, the M3UA 
layer will take the requested action and provide a response to Layer 
Management.

An M-SCTP ESTABLISH request from Layer Management will initiate the 
establishment of an SCTP association.  An M-SCTP ESTABLISH confirm will 
be sent to Layer Management when the initiated association set-up is 
complete.  An M-SCTP ESTABLISH indication is sent to Layer Management 
upon successful completion of an incoming SCTP association set-up from 
a peer M3UA node




Sidebottom et al                                             [Page 53]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


An M-SCTP RELEASE request from Layer Management initates the tear-
down of an SCTP association.  An M-SCTP RELEASE confirm is sent to 
Layer Management when the association teardown is complete.   An M-SCTP 
RELEASE indication is sent to Layer Management upon successful tear-
down of an SCTP association initiated by a peer M3UA

An M-SCTP STATUS request supports a Layer Management query of the local 
status of a particular SCTP association.  The M3UA responds with the 
association status in an M-SCTP STATUS confirm.  No peer protocol is 
invoked.

An M-ASP STATUS request supports a Layer Management query of the status 
of a particular local or remote ASP.  The M3UA responds with the status 
in an M-ASP STATUS confirm.  No M3UA peer protocol is invoked.
 
An M-AS STATUS request supports a Layer Management query of the status 
of a particular AS.  The M3UA responds with an M-AS STATUS confirm.  No 
M3UA peer protocol is invoked.

M-ASP-UP request, M-ASP-DOWN request, M-ASP-ACTIVE request and M-ASP-
INACTIVE request primitives allow Layer Management at an ASP to 
initiate state changes.  Upon successful completion, a corresponding 
confirm is provided by the M3UA to Layer Management.  If the invocation 
is unsuccessful, an Error indication is provided.

These requests result in outgoing M3UA ASP-UP, ASP-DOWN, ASP-ACTIVE and 
ASP-INACTIVE messages to the remote M3UA peer at an SG or IPSP. 


4.2 Receipt of M3UA Peer Management messages

Upon successful state changes resulting from reception of M3UA ASP-UP, 
ASP-DOWN, ASP-ACTIVE and ASP-INACTIVE messages from a peer M3UA, the 
M3UA layer invoke corresponding M-ASP UP, M-ASP DOWN, M-ASP ACTIVE and 
M-ASP INACTIVE, M-AS ACTIVE, M-AS INACTIVE, and M-AS DOWN indications 
as appropriate to the Layer Management.

M-NOTIFY indication and M-ERROR indication indicate to Layer Management 
the notification or error information contained in a received M3UA 
Notify or Error message.  These indications can also be generated based 
on local M3UA events.


4.3 Procedures to support the M3UA Management services

These procedures support the M3UA management of SCTP Associations 
between SGs and ASPs.





Sidebottom et al                                             [Page 54]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


4.3.1 AS and ASP State Maintenance

The M3UA layer on the SG maintains the state of each remote ASP, in 
each Application Server that the ASP is configured to receive traffic, 
as input to the M3UA message distribution function.  Similarly, where 
IPSPs use M3UA in a point-to-point fashion, the M3UA layer in an IPSP 
maintains the state of remote ASPs in IPSPs. For the purposes of the 
following procedures, only the SG/ASP case is described but the SG side 
of the procedures also apply to an IPSP sending traffic to an AS 
consisting of remote ASPs in IPSPs.




4.3.1.1  ASP States

The state of each remote ASP, in each AS that it is configured to 
operate, is maintained in the M3UA layer in the SG or IPSP. The state 
of a particular ASP in a particular AS changes due to events. The 
events include:

   * Reception of messages from the peer M3UA layer at the ASP
   * Reception of some messages from the peer M3UA layer at other ASPs  
     in the AS (e.g., ASPAC Take-over)
   * Reception of indications from the SCTP layer

The ASP state transition diagram is shown in Figure 4.  The possible 
states of an ASP are:

ASP-DOWN: The remote M3UA peer at the ASP is unavailable and/or the 
related SCTP association is down.  Initially all ASPs will be in this 
state.  An ASP in this state should not be sent any M3UA messages.

ASP-INACTIVE: The remote M3UA peer at the ASP is available (and the 
related SCTP association is up) but application traffic is stopped.  In 
this state the ASP can be sent any non-Data M3UA messages.

ASP-ACTIVE: The remote M3UA peer at the ASP is available and 
application traffic is active (for a particular Routing Context or set 
of Routing Contexts).

ASP-STANDBY: The remote M3UA peer at the ASP is available and ready to 
receive application traffic at any time (for a particular Routing 
Context or set of Routing Contexts).  In this state the ASP can be sent 
any non-Data M3UA messages.







Sidebottom et al                                             [Page 55]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


                 Figure 4: ASP State Transition Diagram

                                   +-------------+ 
                                   | ASP-ACTIVE  |
            +----------------------|      or     |
            |    Alternate +-------| ASP-STNDBY* |
            |       ASP    |       +-------------+
            |     Takeover |           ^     |
            |              |    ASP    |     | ASP
            |              |    Active |     | Inact
            |              |           |     v
            |              |       +-------------+
            |              |       |             |
            |              +------>|  ASP-INACT  |
            |                      +-------------+
            |                          ^    |
  ASP Down/ |                     ASP  |    | ASP Down /
  SCTP CDI  |                     Up   |    | SCTP CDI
            |                          |    v
            |                      +-------------+
            |                      |             |
            +--------------------->|             |
                                   |  ASP-DOWN   |
                                   +-------------+


*Note: ASP-ACTIVE and ASP-STNDBY differ only in whether the ASP is 
currently receiving Data traffic.

SCTP CDI: The local SCTP layer's Communication Down Indication to the 
Upper Layer Protocol (M3UA) on an SG. The local SCTP will send this 
indication when it detects the loss of connectivity to the ASP's peer 
SCTP layer.  SCTP CDI is understood as either a SHUTDOWN COMPLETE 
notification or COMMUNICATION LOST notification from the SCTP.

4.3.1.2  AS States

The state of the AS is maintained in the M3UA layer on the SG.

The state of an AS changes due to events. These events include:

   * ASP state transitions
   * Recovery timer triggers

The possible states of an AS are:

AS-DOWN: The Application Server is unavailable.  This state implies 
that all related ASPs are in the ASP-DOWN state for this AS. Initially 
the AS will be in this state.



Sidebottom et al                                             [Page 56]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


AS-INACTIVE: The Application Server is available but no application 
traffic is active (i.e., one or more related ASPs are in the ASP-
Inactive state, but none in the ASP-Active state).

AS-ACTIVE: The Application Server is available and application traffic 
is active.  This state implies that at least one ASP is in the ASP-
ACTIVE state.

AS-PENDING: An active ASP has transitioned to inactive and it was the 
last remaining active ASP in the AS (and no STANDBY ASPs are available. 
A recovery timer T(r) will be started and all incoming SCN messages 
will be queued by the SG. If an ASP becomes active before T(r) expires, 
the AS will move to AS-ACTIVE state and all the queued messages will be 
sent to the active ASP. 

If T(r) expires before an ASP becomes active, the SG stops queuing 
messages and discards all previously queued messages. The AS will move 
to AS-INACTIVE if at least one ASP is in ASP-INACTIVE state, otherwise 
it will move to AS-DOWN state.

                 Figure 5: AS State Transition Diagram

      +----------+   one ASP trans to ACTIVE   +-------------+
      |          |---------------------------->|             |      
      | AS-INACT |                             |  AS-ACTIVE  |
      |          |<---                         |             |
      +----------+    \                        +-------------+
         ^   |         \ Tr Expiry,                ^    |
         |   |          \ at least one             |    |
         |   |           \ ASP in INACT            |    |
         |   |            \                        |    |
         |   |             \                       |    |
         |   |              \                      |    |
 one ASP |   | all ASP       \            one ASP  |    | Last ACT ASP
 trans   |   | trans to       \           trans to |    | trans to 
INACT
 to INACT|   | DOWN            -------\   ACTIVE   |    | or DOWN
         |   |                         \           |    | 
         |   |                          \          |    |
         |   |                           \         |    |
         |   |                            \        |    |
         |   v                             \       |    v         
      +----------+                          \  +-------------+
      |          |                           --|             |      
      | AS-DOWN  |                             | AS-PENDING  |
      |          |                             |  (queueing) |
      |          |<----------------------------|             |
      +----------+       Tr Expiry no ASP      +-------------+
                         in INACT state

    Tr = Recovery Timer

Sidebottom et al                                             [Page 57]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


4.3.2 M3UA Management procedures for primitives

Before the establishment of an SCTP association the ASP state at both 
the SG and ASP is assumed to be "Down".  

As the ASP is responsible for initiating the setup of an SCTP 
association to an SG, the M3UA layer at an ASP receives an M-SCTP 
ESTABLISH request primitive from the Layer Management. the M3UA layer 
will try to establish an SCTP association with the remote M3UA peer at 
an SG.  Upon reception of an eventual SCTP-Communication Up confirm 
primitive from the SCTP, the M3UA layer will invoke the primitive M-
SCTP ESTABLISH confirm to the Layer Management.

The M3UA layers at the SG will receive an SCTP-CommunicationUp 
indication primitive from the SCTP when the association is successfully 
set up.  The M3UA layer will then invoke the primitive M-SCTP ESTABLISH 
indication to the Layer Management. 

Once the SCTP association is established and assuming that the local 
M3UA-User is ready, the local ASP M3UA Application Server Process 
Maintenance (ASPM) function will initiate the ASPM procedures, using 
the ASP-Up/-Down/-Active/-Inactive messages to convey the ASP-state to 
the SG - see Section 4.3.3. 

If the M3UA layer subsequently receives an SCTP-Communication Down 
indication from the underlying SCTP layer, it will inform the Layer 
Management by invoking the M-SCTP STATUS indication primitive. The 
state of the remote ASP will be moved to "Down".  At an ASP, the MTP3-
User at an ASP will be informed of the unavailability of any affected 
SS7 destinations through the use of MTP-PAUSE primitives.  In the case 
of SS7 network isolation, the local MTP3-Users may be informed by 
implementation-dependent means as there is currently no primitive 
defined for conveying this information.

At an ASP, the Layer Management may try to re-establish the SCTP 
association using M-SCTP ESTABLISH request primitive. 

4.3.3 M3UA Management procedures for peer-to-peer messages

All M3UA MGMT and ASP Maintenance messages are sent on a sequenced 
stream to ensure ordering.  SCTP stream '0' is used.

4.3.3.1 ASP-Up

After an ASP has successfully established an SCTP association to an SG 
or IPSP, the SG or IPSP waits for the ASP to send an ASP-Up message, 
indicating that the ASP M3UA peer is available.  The ASP is always the 
initiator of the ASP-Up exchange.  This action MAY be initiated at the 
ASP by an M-ASP UP request primitive from Layer Management or may be 
initiated automatically by an M3UA management function.   


Sidebottom et al                                             [Page 58]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000

When an ASP-Up message is received at an SG or IPSP and internally the 
remote ASP is not considered locked-out for local management reasons, 
the SG marks the remote ASP as 'Inactive' and informs Layer Management 
with an M-ASP-Up indication primitive.  If the SG knows via 
configuration data which Application Servers that the ASP is configured 
to operate in, it can update the ASP status to "Inactive" in each AS 
pool that it is a member.  Alternatively, the SG may move the ASP into 
a pool of Inactive ASPs available for future activation in AS pool(s) 
denoted in the subsequent ASP-Active Routing Contexts.  The SG responds 
with an ASP-Up Ack message in acknowledgement.  The SG sends an ASP-Up 
Ack message in response to a received ASP-Up message even if the ASP is 
already marked as "Inactive" at the SG.  

If for any local reason (e.g., management lock-out) the SG cannot 
respond with an ASP-Up Ack, the SG responds to an ASP-Up with an ASP-
Down Ack message with Reason "Management Blocking".  

At the ASP, the ASP-Up Ack message received is not acknowledged. Layer 
Management is informed with an M-ASP UP confirm primitive .

When the Asp sends an ASP-Up it starts timer T(ack).  If the ASP does 
not receive a response to an ASP-Up within T(ack), the ASP MAY restart 
T(ack) and resend ASP-Up messages until it receives an ASP-Up Ack 
message.  T(ack) is provisionable, with a default of 2 seconds.  
Alternatively, retransmission of ASP-Up messages may be put under 
control of Layer Management.  In this method, expiry of T(ack) results 
in a M-ASP-Up confirmation carrying a negative indication.  

The ASP must wait for the ASP-Up Ack message before sending any ASP 
messages (e.g., ASPAC).  If the remote peer receives any other M3UA 
messages before an ASP Up is received, the remote peer should 
discard them.

4.3.3.2 ASP-Down

The ASP will send an ASP-Down to an SG or IPSP when the ASP wishes to 
be removed from service in all Application Servers that it is a member 
And no longer receive any M3UA traffic or management messages.  This 
action MAY be initiated at the ASP by an M-ASP DOWN request primitive 
from Layer Management or may be initiated automatically by an M3UA 
management function.   

Whether the ASP is permanently removed from any AS is a function of 
configuration management.

The SG marks the ASP as "Down", informs Layer Management with an M-ASP-
Up indication primitive, and returns an ASP-Down Ack message to the ASP 
if one of the following events occur:

    - an ASP-Down message is received from the ASP,
    - another ASPM message is received from the ASP and the SG has  
      locked out the ASP for management reasons.

Sidebottom et al                                             [Page 59]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


The SG sends an ASP-Down Ack message in response to a received ASP-Down 
message from the ASP even if the ASP is already marked as "Down" at the 
SG.  

At the ASP, the ASP-Down Ack message received is not acknowledged. 
Layer Management is informed with an M-ASP Down confirm primitive.

When the Asp sends an ASP-Down it starts timer T(ack).  If the ASP does 
not receive a response to an ASP-Down within T(ack), the ASP MAY 
restart T(ack) and resend ASP-Down messages  until it receives an 
ASP-Down Ack message.  T(ack) is provisionable, with a default of 2 
seconds.  Alternatively, retransmission of ASP-Down messages may be put 
under control of Layer Management.  In this method, expiry of T(ack) 
results in a M-ASP-Down confirmation carrying a negative indication.  

4.3.3.3 M3UA Version Control

If an ASP-Up message with an unsupported version is received, the 
receiving end responds with an Error message, indicating the version 
the receiving node supports and notifies Layer Management.

This is useful when protocol version upgrades are being performed in a 
network.  A node upgraded to a newer version should support the older 
versions used on other nodes it is communicating with.  Because ASPs 
initiate the ASP-Up procedure it is assumed that the Error message 
would normally come from the SG.

4.3.3.4 ASP-Active

Anytime after the ASP has received an ASP-Up Ack from the SG or IPSP, 
the ASP sends an ASP-Active (ASPAC) to the SG indicating that the ASP 
is ready to start processing traffic.  This action MAY be initiated at 
the ASP by an M-ASP Active request primitive from Layer Management or 
may be initiated automatically by an M3UA management function.   In the 
case where an ASP wishes to process the traffic for more than one 
Application Server across a common SCTP association, the ASPAC contains 
a list of one or more Routing Contexts to indicate for which 
Application Servers the ASPAC applies. In the case where an ASP-Active 
message does not contain a Routing Context, the receiver must know, via 
configuration data, which AS pools the ASP will be a member.

When an ASP Active (ASPAC) message is received, the SG or IPSP responds 
to the ASP with an ASPAC Ack message, acknowledging that the ASPAC was 
received and, depending on the ASPAC Type value received, moves the ASP 
to the "Active" or "Standby" state within the associated Application 
Server(s). Layer Management is informed with an ASP-Active indication 
primitive.  The ASP MUST not send Data messages before receiving an 
ASPAC Ack.  If the SG or IPSP receives any Data messages before an 
ASPAC is received, the SG or IPSP should discard them.  



Sidebottom et al                                             [Page 60]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


The SG sends an ASP-Active Ack message in response to a received ASP-
Active message from the ASP even if the ASP is already marked as 
"Active" at the SG.  

At the ASP, the ASP-Active Ack message received is not acknowledged. 
Layer Management is informed with an M-ASP Active confirm primitive.

When the ASP sends an ASP-Active it starts timer T(ack).  If 
the ASP does not receive a response to an ASP-Active within T(ack), the 
ASP MAY restart T(ack) and resend ASP-Active messages  until it 
receives an ASP-Active Ack message.  T(ack) is provisionable, with a 
default of 2 seconds.  Alternatively, retransmission of ASP-Active 
messages may be put under control of Layer Management.  In this method, 
expiry of T(ack) results in a M-ASP-Active confirmation carrying a 
negative indication.  

There are two modes of Application Server traffic handling in the SG 
M3UA - Over-ride and Load-share.  The Type parameter in the ASPAC 
message indicates the traffic handling mode used in a particular 
Application Server. If the SG determines that the mode indicated in an 
ASPAC is incompatible with the mode currently used in the AS, the SG 
responds with an Error message indicating "Invalid Traffic Handling 
Mode".

In the case of an Over-ride mode AS, reception of an ASPAC message at 
an SG causes the redirection of all traffic for the AS to the ASP that 
sent the ASPAC.  Any previously active ASP in the AS is now considered 
Inactive and will no longer receive traffic from the SG within the AS.  
The SG or IPSP sends a Notify (Alternate ASP-Active) to the previously 
active ASP in the AS, after stopping all traffic to that ASP.  In the 
case of Over-ride (Standby) mode the actions are the same with the 
exception that the traffic is not started to the ASP until the 
previously active ASP transitions to "Inactive or "Down" state.  At 
this point the ASP that sent the Over-Ride (Standby) ASPAC is moved to 
the Active state and the traffic is redirected.  A Notify message is 
not sent in this case.

In the case of a Load-share mode AS, reception of an ASPAC message at 
an SG or IPSP causes the direction of traffic to the ASP sending the 
ASPAC, in addition to all the other ASPs that are currently active in 
the AS.  The algorithm at the SG for load-sharing traffic within an AS 
to all the active ASPs is implementation dependent.  The algorithm 
could, for example be round-robin or based on information in the Data 
message (e.g., such as the SLS, SCCP SSN, ISUP CIC value).








Sidebottom et al                                             [Page 61]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


In the case of Load-share (Standby) mode, the actions are the same with 
the exception that the traffic is not started to the ASP until the SG 
or IPSP determines that there are insufficient resources available in 
the AS.  This is likely due to one of the active load-sharing ASPs 
transitions to the "Inactive" or "Down" state.  At this point the ASP 
that sent the Load-share (Standby) ASPAC s moved to the Active state 
and traffic is started.  A Notify message is not sent in this case.

All ASPs within a load-sharing mode AS must be able to handle any 
traffic within the AS, in order to accommodate any potential fail-over 
or rebalancing of the offered load.

A node that receives an ASPAC with an incorrect Type for a particular 
Routing Context will respond with an Error Message (Cause: Invalid 
Traffic Handling Mode).  A node that receives an unknown Routing 
Context value responds with an Error message (Cause: Invalid Routing 
Context).

4.3.3.5 ASP Inactive

When an ASP wishes to withdraw from receiving traffic within an AS, the 
ASP sends an ASP Inactive (ASPIA) to the SG or IPSP.  This action MAY 
be initiated at the ASP by an M-ASP INACTIVE request primitive from 
Layer Management or may be initiated automatically by an M3UA 
management function.   In the case where an ASP is processing the 
traffic for more than one Application Server across a common SCTP 
association, the ASPIA contains one or more Routing Contexts to 
indicate for which Application Servers the ASPIA applies.  In the case 
where an ASP-Inactive message does not contain a Routing Context, the 
receiver must know via configuration data which AS pools the ASP is a 
member and move the ASP to the "Inactive" state in each AS.

There are two modes of Application Server traffic handling in the SG or 
IPSP M3UA when withdrawing an ASP from service - Over-ride and Load-
share.  The Type parameter in the ASPIA message indicates the mode used 
in a particular Application Server.  If the SG or IPSP determines that 
the mode indicates in an ASPIA is inconsistent with the traffic 
handling mode currently used in the AS, a this is reported to local 
management indicating("Invalid Traffic Handling Mode").  The ASPIA is 
still processed.

In the case of an Over-ride mode AS, where another ASP has already 
taken over the traffic within the AS with an Over-ride ASPAC, the ASP 
that sends the ASPIA is already considered by the SG to be "Inactive".  
An ASPIA Ack message is sent to the ASP, after ensuring that all 
traffic is stopped to the ASP. 

In the case of a Load-share mode AS, the SG moves the ASP to the 
"Inactive" state and the AS traffic is re-allocated across the 
remaining "active" ASPs per the load-sharing algorithm currently used


Sidebottom et al                                             [Page 62]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


within the AS.  A NTFY(Insufficient ASPs) may be sent to all inactive 
ASPs, if required.  However, if a Loadshare (Standby) ASP is available, 
it may be now immediately included in the loadshare group and a Notify 
message is not sent.  An ASPIA Ack message is sent to the ASP after all 
traffic is halted and Layer Management is informed with an ASP-INACTIVE 
indication primitive.

At the ASP, the ASP-INACTIVE Ack message received is not acknowledged. 
Layer Management is informed with an M-ASP INACTIVE confirm primitive.
When the ASP sends an ASP-Inactive it starts timer T(ack).  If the ASP 
does not receive a response to an ASP-Inactive within T(ack), the ASP 
MAY restart T(ack) and resend ASP-Inactive messages  until it receives 
an ASP-Inactive Ack message.  T(ack) is provisionable, with a default 
of 2 seconds.  Alternatively, retransmission of ASP-Inactive messages 
may be put under control of Layer Management.  In this method, expiry 
of T(ack) results in a M-ASP-Inactive confirmation carrying a negative 
indication.  

If no other ASPs are "Active" or "Standby" in the Application Server, 
the SG sends a NTFY(AS-Pending) to all inactive ASPs of the AS and 
either discards all incoming messages for the AS or starts buffering 
the incoming messages for T(r)seconds, after which messages will be 
discarded.  T(r) is configurable by the network operator.  If the SG 
receives an ASPAC from an ASP in the AS before expiry of T(r), the 
buffered traffic is directed to the ASP and the timer is cancelled.  If 
T(r) expires, the AS is moved to the "Down" state.

4.3.3.6 Notify

A Notify message reflecting a change in the AS state is sent to all 
ASPs in the AS, except those in the "Down" state, with appropriate 
Status Identification.  At the ASP, Layer Management is informed with 
an M-NOTIFY indication primitive.

In the case where a Notify (AS-Pending) message is sent by an SG that 
now has no ASPs active to service the traffic, or a NTFY(Insufficient 
ASPs) is sent in the Loadshare mode, the Notify does not explicitly 
force the ASP(s) receiving the message to become active. The ASPs 
remain in control of what (and when) action is taken.

4.3.3.7 Heartbeat

The optional Heartbeat procedures may be used when operating over 
transport layers that do not have their own heartbeat mechanism for 
detecting loss of the transport association (i.e., other than the 
SCTP).  

After receiving an ASP-Up Ack message from an M3UA peer in response to 
an ASP-Up message, an ASP may optionally send Beat messages


Sidebottom et al                                             [Page 63]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


periodically, subject to a provisionable timer T(beat).  Upon receiving 
a BEAT message, the M3UA peer MUST respond with a BEAT ACK message.  If 
no BEAT ACK message (or any other M3UA message), is received by the ASP 
within the timer 2*T(beat), the ASP will consider the remote M3UA peer 
as "Down".

At the ASP, if no BEAT ACK message (or any other M3UA message) is 
received from the M3UA peer within 2*T(beat), the remote M3UA peer is 
considered unavailable.  Transmission of BEAT messages is stopped and 
ASP-Up procedures are used to re-establish communication with the SG 
M3UA peer.

The BEAT message may optionally contain an opaque Heartbeat Data 
parameter that MUST be echoed back unchanged in the related Beat Ack 
message.  The ASP upon examining the contents of the returned BEAT Ack 
message MAY choose to consider the remote ASP as unavailable. The 
contents/format of the Heartbeat Data parameter is implementation-
dependent and only of local interest to the original sender.  The 
contents may be used, for example, to support a Heartbeat sequence 
algorithm (to detect missing Heartbeats), and/or a timestamp mechanism 
(to evaluate delays).

Note: Heartbeat related events are not shown in Figure 4 "ASP state 
transition diagram".  


4.4 Procedures to support the M3UA services

4.4.1 At an SG

On receiving an MTP-PAUSE, MTP-RESUME, or MTP-STATUS indication 
primitive from the nodal inter-working function at an SG, the SG M3UA 
layer will send a corresponding SSNM DUNA, DAVA, SCON, or DUPU message 
(see Section 2) to the M3UA peers at concerned ASPs.  The M3UA layer 
must fill in various fields of the SSNM messages consistently with the 
information received in the primitives.  

The SG M3UA determines the set of concerned ASPs to be informed based 
on the SS7 network partition for which the primitive indication is 
relevant. In this way, all ASPs configured to send/receive traffic 
within a particular network appearance are informed.  If the SG 
operates within a single SS7 network appearance, then all ASPs are 
informed.  

Optionally, the SG M3UA may filter further based on the Affected Point 
Code in the MTP-PAUSE, MTP-Resume, or MTP-Status indication primitives.  
In this way ASPs can be informed only of affected destinations to which 
they actually communicate.  The SG M3UA may also suppress DUPU messages 
to ASPs that do not implement an MTP3-User protocol peer for the 
affected MTP3-User.


Sidebottom et al                                             [Page 64]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


DUNA, DAVA, SCON messages must be sent on a sequenced stream as these 
primitives should arrive in order.  Stream 0 is used.  Sequencing is 
not required for the DUPU or DAUD message, which may optionally be sent 
un-sequenced.  The same applies for the SCON message if the 
international congestion method (see Q.704) is used.

4.4.2 At an ASP

4.4.2.1 Single SG configurations

At an ASP, upon receiving an SSNM message from the remote M3UA Peer, 
the M3UA layer invokes the appropriate primitive indications to the 
resident M3UA-Users.  Local management is informed.

In the case where a local event has caused the unavailability or 
congestion status of SS7 destinations, the M3UA at the ASP should pass 
up appropriate indications n the primitives to the M3UA User, as though 
equivalent SSNM messages were received.  For example, the loss of an 
SCTP association to an SG may cause the unavailability of a set of SS7 
destinations.  MTP-Pause indications to the M3UA User is appropriate.  
To accomplish this, the M3UA layer at an ASP maintains the status of 
routes via the SG, much like an MTP3 layer maintains route-set status.

4.4.2.2 Multiple SG configurations

At an ASP, upon receiving an SSNM message from the remote M3UA Peer, 
the 
M3UA layer updates the status of the affected route(s) via the 
originating SG and determines, whether or not the overall availability 
or congestion status of the effected destination(s) has changed. In 
this case the M3UA layer invokes the appropriate primitive indications 
to the resident M3UA-Users.  Local management is informed.

4.4.3 ASP Auditing

An ASP may optionally initiate an audit procedure in order to enquire 
of an SG the availability and, if the congestion method with multiple 
congestion levels and message priorities is used, congestion status of 
an SS7 destination or set of destinations.  A Destination Audit (DAUD) 
message is sent from the ASP to the SG requesting the current 
availability and congestion status of one or more SS7 Destination Point 
Codes.

The DAUD may be sent un-sequenced. The DAUD may be sent by the ASP in 
the following cases:  

   - Periodic.  A Timer originally set upon reception of DUNA or SCON 
     message has expired without a subsequent DAVA, DUNA or SCON  
     updating the availability/congestion status of the affected  



Sidebottom et al                                             [Page 65]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000

 
     Destination Point Codes.  The Timer is reset upon issuing a DAUD.   
     In this case the DAUD is sent to the SG that originally sent the  
     SSNM message.
 
   - the ASP is newly "Inactive" or "Active" or has been isolated from 
     an SG for an extended period.  The ASP can request the 
     availability/congestion status of one or more SS7 destinations to  
     which it expects to communicate.

In the first case, the DAUD procedure must not be invoked for the case 
of  received SCON containing a congestion level value of "no 
congestion" or undefined" (i.e., congestion Level = "0").  This is 
because the value indicates either congestion abatement or that the ITU 
MTP3 international congestion method is being used.  In the 
international congestion method, the MTP3 at the SG MTP3 does not 
maintain the congestion status of any destinations and therefore the SG 
cannot provide any congestion information in response to the DAUD.  For 
the same reason, in the second case a DAUD cannot reveal any congested 
destination(s).

The SG MUST respond to a DAUD with the MTP3 status of the routeset 
associated with each Destination Point Code(s) in the DAUD.  The status 
of each SS7 destination requested is indicated in a DUNA (if 
unavailable), DAVA (if available/uncongested) or an SCON (if 
available/congested).  Optionally, any DUNA or DAVA message in response 
to a DAUD may contain a list of up to sixteen Affected Point Codes. 

Note that from the point of view of an ASP sending an DAUD, the 
subsequent reception of an SCON implies that the Affected Destination 
is available.  The reception of a DAVA implies that the routeset to the 
Affected Destination is not congested.  Obviously with the reception of 
an DUNA, the routeset to the Affected Destination can not also be 
congested.



















Sidebottom et al                                             [Page 66]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


5.0 Examples of M3UA Procedures

5.1 Establishment of Association and Traffic between SGs and ASPs

5.1.1 Single ASP in an Application Server ("1+0" sparing)

This scenario shows the example M3UA message flows for the 
establishment of traffic between an SG and an ASP, where only one ASP 
is configured within an AS (no backup).  It is assumed that the SCTP 
association is already set-up. The sending of DUNA/SCON messages by the 
SG is not shown but would be similar to 5.1.2.

             SG                       ASP1
              |
              |<---------ASP Up----------| 
              |-------ASP-Up Ack-------->|
              |                          | 
              |<-------ASP Active--------| 
              |-----ASP Active Ack------>|
              |                          |

5.1.2 Two ASPs in Application Server ("1+1" sparing)

This scenario shows the example M3UA message flows for the 
establishment of traffic between an SG and two ASPs in the same 
Application Server, where ASP1 is configured to be "active" and ASP2 a 
"standby" in the event of communication failure or the withdrawal from 
service of ASP1.  ASP2 may act as a hot, warm, or cold standby 
depending on the extent to which ASP1 and ASP2 share call/transaction 
state or can communicate call state under failure/withdrawal events.  
The example message flow is the same whether the ASP-Active messages 
are Over-ride or Load-share mode although typically this example would 
use an Over-ride mode. In the case of MTP Restart, the SG starts 
sending any relevant DUNA and SCON messages to the ASPs as soon as they 
enter the ASP-INACTIVE state. The ASP-Active Ack message is only sent 
after all relevant DUNA/SCON messages have been transmitted to the 
concerned ASP.

       SG                        ASP1                        ASP2
        |                         |                          |
        |<--------ASP Up----------|                          | 
        |-------ASP-Up Ack------->|                          |
        |                         |                          |
        |<-----------------------------ASP Up----------------|
        |-----------------------------ASP-Up Ack------------>|
        |                         |                          | 
        |                         |                          |
        |<-------ASP Active-------|                          | 
        |------ASP-Active Ack---->|                          | 
        |                         |                          |


Sidebottom et al                                             [Page 67]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


5.1.3 Two ASPs in an Application Server ("1+1" sparing, load-sharing 
case)

This scenario shows a similar case to Section 4.1.2 but where the two 
ASPs are brought to "active" and load-share the traffic load.  In this 
case, one ASP is sufficient to handle the total traffic load. The 
sending of DUNA/SCON messages by the SG is not shown but would be 
similar to 5.1.2.

       SG                       ASP1                       ASP2
        |                         |                          |
        |<---------ASP Up---------|                          | 
        |--------ASP-Up Ack------>|                          |
        |                         |                          |
        |<------------------------------ASP Up---------------|
        |-----------------------------ASP Up Ack------------>|
        |                         |                          | 
        |                         |                          |
        |<--ASP Active (Ldshr)----|                          | 
        |-----ASP-Active Ack----->|                          | 
        |                         |                          |
        |<----------------------------ASP Active (Ldshr)-----| 
        |-------------------------------ASP-Active Ack------>| 
        |                         |                          |


5.1.4 Three ASPs in an Application Server ("n+k" sparing, load-sharing 
case) 

This scenario shows the example M3UA message flows for the 
establishment of traffic between an SG and three ASPs in the same 
Application Server, where two of the ASPs are brought to "active" and 
share the load. In this case, a minimum of two ASPs are required to 
handle the total traffic load (2+1 sparing). The sending of DUNA/SCON 
messages by the SG is not shown but would be similar to 5.1.2.

















Sidebottom et al                                             [Page 68]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


   SG                  ASP1                 ASP2                 ASP3 
    |                    |                   |                   |
    |<------ASP Up-------|                   |                   | 
    |-----ASP-Up Ack---->|                   |                   |
    |                    |                   |                   |
    |<--------------------------ASP Up-------|                   |
    |-------------------------ASP-Up Ack)--->|                   |
    |                    |                   |                   |
    |<---------------------------------------------ASP Up--------|
    |---------------------------------------------ASP-Up Ack---->|
    |                    |                   |                   | 
    |                    |                   |                   |
    |<--ASP Act (Ldshr)--|                   |                   | 
    |----ASP-Act Ack---->|                   |                   | 
    |                    |                   |                   |
    |<--------------------ASP Act. (Ldshr)---|                   | 
    |-----------------------ASP-Act Ack----->|                   | 
    |                    |                   |                   |


5.2 ASP Traffic Fail-over Examples

5.2.1 (1+1 Sparing, withdrawal of ASP, Back-up Over-ride) 

Following on from the example in Section 4.1.2, and ASP withdraws from 
service:

       SG                       ASP1                       ASP2 
        |                         |                          |
        |<-----ASP Inactive-------|                          |
        |----ASP Inactive Ack---->|                          |
        |------------------------NTFY(AS-Inact.)(Optional)-->| 
        |                         |                          | 
        |<------------------------------ ASP Active----------| 
        |------------------------------ASP-Active Ack)------>| 
        |                                                    |

Note: If the SG detects loss of the M3UA peer (M3UA heartbeat loss or 
detection of SCTP failure), the initial SG-ASP1 ASP Inactive message 
exchange would not occur.












Sidebottom et al                                             [Page 69]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


5.2.2 (1+1 Sparing, Back-up Over-ride)

Following on from the example in Section 4.1.2, and ASP2 wishes to 
over-ride ASP1 and take over the traffic:

       SG                       ASP1                       ASP2 
        |                         |                          | 
        |<------------------------------ ASP Active----------| 
        |-------------------------------ASP-Active Ack------>|
        |----NTFY(Alt ASP-Act)--->| 
        |                         |                          | 


5.2.3 (n+k Sparing, Load-sharing case, withdrawal of ASP)

Following on from the example in Section 4.1.4, and ASP1 withdraws from 
service:

   SG                  ASP1                 ASP2                 ASP3 
    |                    |                   |                   |
    |<----ASP Inact.-----|                   |                   | 
    |---ASP-Inact Ack--->|                   |                   |
    |                    |                   |                   | 
    |---------------------------------NTFY(Ins. ASPs)(Optional)->| 
    |                    |                   |                   |
    |<-----------------------------------------ASP Act (Ldshr)---| 
    |-------------------------------------------ASP Act (Ack)--->|
    |                    |                   |                   |


The Notify message to ASP3 is optional, as well as the ASP-Active from 
ASP3.  The optional Notify can only occur if the SG maintains knowledge 
of the minimum ASP resources required - for example if the SG knows 
that "n+k" = "2+1" for a load-share AS and "n" currently equals "1". 

Note: If the SG detects loss of the ASP1 M3UA peer (M3UA heartbeat loss 
or detection of SCTP failure), the first SG-ASP1 ASP Inactive message 
exchange would not occur.  


5.3  M3UA/MTP3-User Boundary Examples

5.3.1 At an ASP

This section describes the primitive mapping from the MTP3 User to M3UA 
at an ASP.  






Sidebottom et al                                             [Page 70]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


5.3.1.1 Support for MTP-Transfer on the ASP

5.3.1.1.1 Support for MTP-Transfer Request
When the MTP3-User on the ASP has data to send into the SS7 network, it 
will use the MTP-Transfer Request primitive.  The M3UA on the ASP will 
do the following when it receives an MTP-Transfer Request primitive 
from the M3UA user:

  - Determine the correct SG

  - Determine the correct association to the chosen SG

  - Determine the correct stream in the association (e.g., based on  
    SLS)

  - Determine whether to complete the optional fields of the Data  
    message

  - Map the MTP-Transfer Request primitive into the Protocol Data  
    field of an m3ua Data message

  - Send the Data message to the remote M3UA peer in the SG, over the  
    SCTP association

        SG                       ASP   
        |                         |                  
        |<-----Data Message-------|<--MTP-Transfer req. 
        |                         | 

        
5.3.1.1.2 Support for MTP Transfer Indication

When the M3UA on the ASP has received Data messages from the remote 
M3UA peer in the SG it will do the following:

  - Evaluate the optional fields of the Data message if present

  - Map the Payload of a Data message into the MTP-Transfer Indication  
    primitive

  - Pass the MTP-Transfer Indication primitive to the user part. In  
    case of multiple user parts, the optional fields of the Data
    message are used to determine the concerned user part.

        SG                       ASP   
        |                         |
        |------Data Message------>|---MTP-Transfer ind.
        |                         |          



             
Sidebottom et al                                             [Page 71]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


5.3.1.1.3 Support for ASP Querying of SS7 Destination States

There are situations such as temporary loss of connectivity to the SG 
that may cause the M3UA on the ASP to audit SS7 destination 
availability states.  Note: there is no primitive for the MTP3-User to 
request this audit from the M3UA as this is initiated by an internal 
M3UA management function.  

The M3UA on the ASP normally sends Destination State Audit (DAUD) 
messages for each of the destinations that the ASP supports.

       SG                        ASP   
        |                         |                  
        |<-----DAUD Message ------| 
        |<-----DAUD Message ------| 
        |<-----DAUD Message ------| 
        |                         |                     
        |                         |             

5.3.2 At an SG 

This section describes the MTP3 upper layer primitive mapping to the 
M3UA at the SG.

5.3.2.1 Support for MTP-Transfer Request at the SG

When the M3UA on the SG has received Data messages from its peer 
destined to the SS7 network it will do the following:

  - Evaluate the optional fields of the Data message if present to  
    determine the network appearance

  - Map the Protocol data of the Data message into an MTP-Transfer  
    Request primitive

  - Pass the MTP-Transfer Request primitive to the MTP3 of the  
    concerned network appearance.

                            SG                        ASP
                             |                         |
        <---MTP-Transfer req.|<------Data Message------|
                             |                         |


5.3.2.2 Support for MTP-Transfer Indication at the SG

When the MTP3 on the SG has data to pass its user parts, it will use 
the MTP-Transfer Indication primitive.  The M3UA on the SG will do the 
following when it receives an MTP-Transfer Indication:



Sidebottom et al                                             [Page 72]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


  - Determine the correct ASP

  - Determine the correct association to the chosen ASP

  - Determine the correct stream in the association (e.g., based on  
    SLS)

  - Determine whether to complete the optional fields of the Data  
    message

  - Map the MTP-Transfer Indication primitive into the Protocol Data  
    field of an M3UA Data message

  - Send the Data message to the remote M3UA peer in the ASP, over the  
    SCTP association 

                           SG                        ASP
                            |                         |
       --MTP-Transfer ind.->|------Data Message------>|
                            |                         |


5.3.2.3 Support for MTP-PAUSE, MTP-RESUME, MTP-STATUS

The MTP-PAUSE, MTP-RESUME and MTP-STATUS indication primitives from the 
MTP3 upper layer interface at the SG need to be made available to the 
remote MTP3 User Part lower layer interface at the concerned ASP(s).

5.3.2.3.1 Destination Unavailable 

The MTP3 on the SG will generate an MTP-PAUSE primitive when it 
determines locally that an SS7 destination is unreachable.  The M3UA 
will map this primitive to a Destination Unavailable (DUNA) message.  
The SG M3UA determines the set of concerned ASPs to be informed based 
on internal SS7 network information associated with the MTP-PAUSE 
primitive indication.

                   SG                       ASP   
                    |                         |
 --MTP-PAUSE ind.-->|------DUNA Message ----->|--MTP-PAUSE ind.-->
                    |                         |


5.3.2.3.2 Destination Available

The MTP3 on the SG will generate an MTP-RESUME primitive when it 
determines locally that an SS7 destination that was previously 
unreachable is now reachable.  The M3UA will map this primitive to a 
Destination Available (DAVA) message.  The SG M3UA determines the set 
of concerned ASPs to be informed based on internal SS7 network 
information associated with the MTP-RESUME primitive indication.

Sidebottom et al                                             [Page 73]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


                   SG                       ASP   
                    |                         |
--MTP-RESUME ind.-->|------DAVA Message ----->|--MTP-RESUME ind.-->
                    |                         |


5.3.2.3.3 SS7 Network Congestion 

The MTP3 on the SG will generate an MTP-STATUS primitive when it 
determines locally that the route to an SS7 destination is congested.  
The M3UA will map this primitive to a SS7 Network Congestion State 
(SCON) message.  It will determine which ASP(s) to send the DUPU to 
based on the intended Application Server.
 
                     SG                       ASP   
                       |                         |                  
   --MTP-STATUS ind.-->|------SCON Message ----->|--MTP-STATUS ind.--> 
                       |                         |

5.3.2.3.4 Destination User Part Unavailable

The MTP3 on the SG will generate an MTP-STATUS primitive when it 
receives an UPU message from the SS7 network.  The M3UA will map this 
primitive to a Destination User Part Unavailable (DUPU) message.  It 
will determine which ASP(s) to send the DUPU based on the intended 
Application Server.

                      SG                       ASP   
                       |                         |                  
   --MTP-STATUS ind.-->|------DUPU Message ----->|--MTP-STATUS ind.--> 
                       |                         | 


6.0 Security

6.1 Introduction

M3UA is designed to carry signalling messages for telephony services. 
As such, M3UA must involve the security needs of several parties: the 
end users of the services; the network providers and the applications 
involved.  Additional requirements may come from local regulation.  
While having some overlapping security needs, any security solution 
should fulfill all of the different parties' needs. 









Sidebottom et al                                             [Page 74]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


6.2 Threats

There is no quick fix, one-size-fits-all solution for security.  As a 
transport protocol, M3UA has the following security objectives:

 * Availability of reliable and timely user data transport.
 * Integrity of user data transport.
 * Confidentiality of user data.

M3UA runs on top of SCTP.  SCTP [6] provides certain transport related
security features, such as some protection against:

 * Blind Denial of Service Attacks
 * Flooding
 * Masquerade
 * Improper Monopolization of Services

When M3UA is running in professionally managed corporate or service 
provider network, it is reasonable to expect that this network includes 
an appropriate security policy framework. The "Site Security Handbook" 
[21] should be consulted for guidance.

When the network in which M3UA runs in involves more than one party, it 
may not be reasonable to expect that all parties have implemented 
security in a sufficient manner.  In such a case, it is recommended 
that

IPSEC is used to ensure confidentiality of user payload.  Consult [22] 
for more information on configuring IPSEC services.

6.3 Protecting Confidentiality 

Particularly for mobile users, the requirement for confidentiality may 
include the masking of IP addresses and ports.  In this case 
application level encryption is not sufficient; IPSEC ESP should be 
used instead.  Regardless of which level performs the encryption, the 
IPSEC ISAKMP service should be used for key management.


7.0 IANA Considerations

7.1 SCTP Payload Protocol Identifier

A request will be made to IANA to assign an M3UA value for the Payload 
Protocol Identifier in SCTP Payload Data chunk.  The following SCTP 
Payload Protocol Identifier will be registered:

        M3UA    "3"




Sidebottom et al                                             [Page 75]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


The SCTP Payload Protocol Identifier is included in each SCTP Data 
chunk, to indicate which protocol the SCTP is carrying. This Payload 

Protocol Identifier is not directly used by SCTP but MAY be used by 
certain network entities to identify the type of information being 
carried in a Data chunk.

The User Adaptation peer MAY use the Payload Protocol Identifier as a 
way of determining additional information about the data being 
presented to it by SCTP.

7.2 M3UA Protocol Extensions

This protocol may also be extended through IANA in three ways:
 -- through definition of additional message classes,
 -- through definition of additional message types, and 
 -- through definition of additional message parameters

The definition and use of new message classes, types and parameters is 
an integral part of SIGTRAN adaptation layers.  Thus these extensions 
are assigned by IANA through an IETF Consensus action as defined in 
[RFC2434].

The proposed extension must in no way adversely affect the general 
working of the protocol.

7.2.1 IETF Defined Message Classes

The documentation for a new message class MUST include the following 
information:
(a) A long and short name for the new message class;
(b) A detailed description of the purpose of the message class.

7.2.2 IETF Defined Message Types

The documentation for a new message type MUST include the following 
information:
(a) A long and short name for the new message type;
(b) A detailed description of the structure of the message. 
(c) A detailed definition and description of intended use for each 
    field within the message. 
(d) A detailed procedural description of the use of the new message 
    type within the operation of the protocol. 
(e) A detailed description of error conditions when receiving this 
    message type. 

When an implementation receives a message type which it does not 
support, it MUST respond with an Error (ERR) message, with an Error 
Code = Unsupported Message Type.


Sidebottom et al                                             [Page 76]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


7.2.3 IETF-defined TLV Parameter extension

Documentation of the message parameter MUST contain the following 
information:

(a) Name of the parameter type.
(b) Detailed description of the structure of the parameter field.  This 
    structure MUST conform to the general type-length-value format 
    described in Section 3.1.5.  
(c) Detailed definition of each component of the parameter value. 
(d) Detailed description of the intended use of this parameter type, 
    and an indication of whether and under what circumstances multiple 
    instances of this parameter type may be found within the same 
    message.


8.0 Acknowledgements

The authors would like to thank John Loughney, Neil Olson, Michael 
Tuexen, Nikhil Jain, Steve Lorusso, Dan Brendes, Joe Keller, Heinz 
Prantner, Barry Nagelberg, Naoto Makinae for their valuable comments 
and suggestions.


9.0  References

[1] RFC 2719, "Framework Architecture for Signaling Transport"

[2] ITU-T Recommendations Q.761 to Q.767, 'Signalling System No.7 (SS7)  
    - ISDN User Part (ISUP)'

[3] ANSI T1.113 - 'Signaling System Number 7 - ISDN User Part

[4] ETSI ETS 300 356-1 "Integrated Services Digital Network (ISDN);  
    Signalling System No.7; ISDN User Part (ISUP) version 2 for the  
    international interface; Part 1: Basic services"

[5] ITU-T Recommendations Q.711-715, 'Signalling System No. 7 (SS7) -  
    Signalling Connection Control Part (SCCP)'

[6] ANSI T1.112 'Signaling System Number 7 - Signaling Connection 
    Control Part'

[7] ETSI ETS 300 009-1, "Integrated Services Digital Network (ISDN);  
    Signalling System No.7; Signalling Connection Control Part (SCCP)  
    (connectionless and connection-oriented class 2) to support  
    international interconnection; Part 1: Protocol specification"

[8] ITU-T Recommendations Q.720, 'Telephone User Part'



Sidebottom et al                                             [Page 77]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


[9] ITU-T Recommendation Q.771-775 'Signalling System No. 7 SS7) -  
    Transaction Capabilities (TCAP) 

[10] ANSI T1.114 'Signaling System Number 7 - Transaction Capabilities 
     Application Part'

[11] ETSI ETS 300 287-1, "Integrated Services Digital Network (ISDN);  
     Signalling System No.7; Transaction Capabilities (TC) version 2; 
     Part 1: Protocol specification"

[12] 3G TS 25.410 V3.1.0 (2000-01) Technical Specification - 3rd  
     Generation partnership Project; Technical Specification Group  
     Radio Access Network; UTRAN Iu Interface: General Aspects and  
     Principles (3G TS 25.410 Version 3.1.0 Release 1999) 

[13] RFC 2719, "Stream Control Transport Protocol", R. Stewart et al, 
     October 2000. 
 
[14] ITU-T Recommendations Q.701-Q.705, 'Signalling System No. 7 (SS7)  
     - Message Transfer Part (MTP)'

[15] ANSI T1.111 'Signaling System Number 7 - Message Transfer Part'

[16] ETSI ETS 300 008-1, "Integrated Services Digital Network (ISDN);  
     Signalling System No.7; Message Transfer Part (MTP) to support  
     international interconnection; Part 1: Protocol specification"

[17] ITU-T Recommendation Q.2140 'B-ISDN ATM Adaptation Layer - Service 
     Specific Coordination Function for signalling at the Network Node  
     Interface (SSCF at NNI)

[18] ITU-T Recommendation Q.2110 'B-ISDN ATM Adaptation Layer - Service  
     Specific Connection Oriented Protocol (SSCOP)

[19] MTP2-User Adaptation Layer <draft-ietf-sigtran-m2ua-01.txt>, Nov.  
     1999, Work in Progress

[20] ITU-T Recommendation Q.2210 'B-ISDN MTP'

[21] RFC 2196, "Site Security Handbook", B. Fraser Ed., September 1997 

[22] RFC 2401, "Security Architecture for the Internet Protocol", S.
Kent, R. Atkinson, November 1998.









Sidebottom et al                                             [Page 78]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


10.0  Author's Addresses

Greg Sidebottom
Nortel Networks
3685 Richmond Rd,
Nepean, Ontario, Canada  K2H 5B7
gregside@nortelnetworks.com 

Guy Mousseau
Nortel Networks
3685 Richmond Rd
Nepean, Ontario, Canada  K2H 5B7

Lyndon Ong
Nortel Networks
4401 Great America Pkwy
Santa Clara, CA, USA  95054
long@nortelnetworks.com

Ian Rytina
Ericsson Australia
37/360 Elizabeth Street 
Melbourne, Victoria 3000, Australia
ian.rytina@ericsson.com

Hanns Juergen Schwarzbauer
SIEMENS AG
Hofmannstr. 51
81359 Munich, Germany
HannsJuergen.Schwarzbauer@icn.siemens.de

Klaus D. Gradischnig
SIEMENS AG
Hofmannstr. 51
81359 Munich, Germany
klaus.gradischnig@icn.siemens.de

Ken Morneault
Cisco Systems Inc.
13615 Dulles Technology Drive
Herndon, VA, USA  20171
EMail: kmorneau@cisco.com

Malleswar Kalla
Telcordia Technologies
MCC 1J211R
445 South Street
Morristown, NJ, USA  07960
Email: kalla@research.telcordia.com



Sidebottom et al                                             [Page 79]

Internet Draft       SS7 MTP3-User Adaptation Layer         Nov 2000


Normand Glaude
Performance Technologies
150 Metcalf Sreet, Suite 1300
Ottawa, Ontario, Canada  K2P 1P1
EMail: nglaude@microlegend.com
















This draft expires May 2000.
















Sidebottom et al                                             [Page 80]



